HolgerBurkarth/HomeKit-ESP8266/src/hb_homekit.h
#pragma region Prolog
/*******************************************************************
$CRT 09 Sep 2024 : hb

$AUT Holger Burkarth
$DAT >>hb_homekit.h<< 04 Okt 2024  07:35:39 - (c) proDAD

using namespace HBHomeKit;
*******************************************************************/
#pragma endregion
#pragma region Spelling
// Ignore Spelling: logtab wlogin
#pragma endregion
#pragma region Includes
#pragma once

#include <Arduino.h>
#include <functional>
#include <limits>
#include <array>
#include <memory>
#include <list>
#include <vector>
#include <map>
#include <cstddef>
#include <homekit_debug.h>
#include <arduino_homekit_server.h>
#include <homekit/homekit.h>
#include <homekit/characteristics.h>
#include <StreamDev.h>
#include <Ticker.h>
#include <DNSServer.h>
#if defined(ESP8266)
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#elif defined(ESP32)
#include <WiFi.h>
#endif

namespace HBHomeKit
{
#pragma endregion

#pragma region Globals
#if defined(ESP8266)
extern ESP8266WebServer WebServer;
#elif defined(ESP32)
#endif


#pragma endregion

#pragma region CRange
/* Describes a range defined by a minimum and a maximum.
* The range defines all values from the minimum to
* the maximum, where the range includes the maximum value.
*/
template<typename T>
struct CRange
{
  using value_type = T;

  T Minimum{};
  T Maximum{};

  constexpr auto Length() const { return Maximum - Minimum + 1; }

  constexpr bool IntersectsWith(const CRange& other) const
  {
    return Minimum <= other.Maximum && Maximum >= other.Minimum;
  }

  constexpr bool Contains(const T& value) const
  {
    return value >= Minimum && value <= Maximum;
  }

  friend constexpr bool IsDisabledOrInvalid(const CRange& range)
  {
    return range.Minimum > range.Maximum;
  }

};

using CRangeInt = CRange<int>;
using CRangeFloat = CRange<float>;

#pragma endregion

#pragma region CMedianStack
/* A stack of values that returns the median
 * of the values contained in the stack.
 * @note The stack has a fixed size and is implemented as a ring buffer.
 * @tparam T The type of the values
 * @tparam MaxElements The maximum number of elements in the stack. Odd numbers are preferred.
*/
template<typename T, size_t MaxElements>
class CMedianStack
{
  #pragma region Types
public:
  using value_type = T;
  using container_type = std::array<T, MaxElements>;

  #pragma endregion

  #pragma region Fields
private:
  container_type Container{};
  size_t Count{};

  #pragma endregion

  #pragma region Public Methods
public:

  #pragma region empty
  /* Check if the stack is empty.
  * @return true if the stack is empty, false otherwise
  */
  bool empty() const
  {
    return Count == 0;
  }

  #pragma endregion

  #pragma region clear
  /* Clear the stack.
  */
  void clear()
  {
    Count = 0;
  }

  #pragma endregion

  #pragma region push
  /* Push a value onto the stack.
  * If the stack is full, the oldest value is removed.
  * @param value The value to push
  */
  void push(T value)
  {
    if(Count < MaxElements)
      Container[Count++] = value;
    else
    {
      for(size_t i = 1; i < MaxElements; ++i)
        Container[i - 1] = Container[i];
      Container[MaxElements - 1] = value;
    }
  }

  #pragma endregion

  #pragma region pop
  /* Get the median of the values in the stack.
  * @return The median of the values in the stack
  * @note If the stack is empty, the return value is the default value of T.
  */
  T pop() const
  {
    if(Count > 0)
    {
      if constexpr(MaxElements <= 2)
      {
        return Container[0];
      }
      else if constexpr(MaxElements == 3)
      {
        // sort 3 elements
        T Tmp[3] = { Container[0], Container[1], Container[2] };
        if(Tmp[0] > Tmp[1])
          std::swap(Tmp[0], Tmp[1]);
        if(Tmp[1] > Tmp[2])
          std::swap(Tmp[1], Tmp[2]);
        if(Tmp[0] > Tmp[1])
          std::swap(Tmp[0], Tmp[1]);
        return Tmp[1];
      }
      else
      {
        container_type Sorted = Container;
        std::sort(Sorted.begin(), Sorted.begin() + Count);
        return Sorted[Count / 2];
      }
    }
    return T{};
  }

  #pragma endregion

  //END Public Methods
  #pragma endregion

};

//END CMedianStack
#pragma endregion

#pragma region CKalman1DFilter
// kalman filter linear movement 1d
template<typename T, typename = std::enable_if_t<std::is_floating_point_v<T>>>
struct CKalman1DFilter
{
  T R{ 5e-5 }; // Measurement variance
  T Q{ 1e-5 }; // Process variance
  T Error{ 1 };
  T Value{ std::numeric_limits<T>::min() };
  
  T Update(T measurement)
  {
    if(Value == std::numeric_limits<T>::min())
    {
      Value = measurement;
    }
    else
    {
      Error += Q;
      T Gain = Error / (Error + R);
      Gain = std::min<T>(1, std::max<T>(0, Gain));
      Value += Gain * (measurement - Value);
      Error = (1 - Gain) * Error;
    }
    return Value;

  }
};

#pragma endregion

#pragma region format_text

/* Format a value as text
* @param buffer The buffer to write the text to
* @param size The size of the buffer
* @param fmt The format string
* @param value The value to format
* @return The number of characters written
* @note Overload for bool, int, uint8_t, uint16_t, uint32_t, uint64_t, float, const char*
* @example format_text(buffer, sizeof(buffer), 123);
* @example
* - bool: "true" or "false"
* - int: "123"
* - uint8_t: "23 u8"
*/
template<typename T>
size_t format_text(char* buffer, size_t size, const char* fmt, const T& value);

template<typename T>
size_t format_text_P(char* buffer, size_t size, PGM_P fmt, const T& value);

template<typename T>
size_t format_text(char* buffer, size_t size, const T& value);

template<typename T, size_t N>
size_t format_text(char(&buffer)[N], const T& value);


#pragma region Implementation

template<typename T, size_t N>
size_t format_text(char(&buffer)[N], const T& value)
{
  return format_text<T>(buffer, N, value);
}

template<typename T>
size_t format_text_P(char* buffer, size_t size, PGM_P fmt, const T& value)
{
  return snprintf_P(buffer, size, fmt, value);
}

