HolgerBurkarth/HomeKit-ESP8266/src/hb_homekit.h
template<typename T>
size_t format_text(char* buffer, size_t size, const char* fmt, const T& value)
{
  return snprintf(buffer, size, fmt, value);
}

//END Implementation
#pragma endregion

//END format_text
#pragma endregion

#pragma region +homekit_value_t / homekit_characteristic_t - Support

#pragma region is_value_typeof
/* Check if a homekit_value_t is of a specific type
* @param value The homekit_value_t to check
* @return true if the value is of the specific type, false otherwise
*/
template<typename T>
constexpr bool is_value_typeof(const homekit_value_t& value) noexcept;

#pragma region Implementation
/* bool */
template<> constexpr bool is_value_typeof<bool>(const homekit_value_t& value) noexcept
{
  return value.format == homekit_format_bool;
}

/* int */
template<> constexpr bool is_value_typeof<int>(const homekit_value_t& value) noexcept
{
  return value.format == homekit_format_int;
}

/* uint8_t */
template<> constexpr bool is_value_typeof<uint8_t>(const homekit_value_t& value) noexcept
{
  return value.format == homekit_format_uint8;
}

/* uint16_t */
template<> constexpr bool is_value_typeof<uint16_t>(const homekit_value_t& value) noexcept
{
  return value.format == homekit_format_uint16;
}

/* uint32_t */
template<> constexpr bool is_value_typeof<uint32_t>(const homekit_value_t& value) noexcept
{
  return value.format == homekit_format_uint32;
}

/* uint64_t */
template<> constexpr bool is_value_typeof<uint64_t>(const homekit_value_t& value) noexcept
{
  return value.format == homekit_format_uint64;
}

/* float */
template<> constexpr bool is_value_typeof<float>(const homekit_value_t& value) noexcept
{
  return value.format == homekit_format_float;
}

/* char* */
template<> constexpr bool is_value_typeof<char*>(const homekit_value_t& value) noexcept
{
  return value.format == homekit_format_string;
}

/* const char* */
template<> constexpr bool is_value_typeof<const char*>(const homekit_value_t& value) noexcept
{
  return value.format == homekit_format_string;
}


//END Implementation
#pragma endregion


//END is_value_typeof
#pragma endregion

#pragma region static_value_cast / static_value_ref_cast

/* Cast a homekit_value_t to a specific type
* @param value The homekit_value_t to cast
* @return The value of the homekit_value_t as the specific type
* @example bool b = static_value_cast<bool>(value);
* @note The value is not checked for the specific type.
* @example bool z = static_value_cast<bool>(homekit_value_t{});
*/
template<typename T>
constexpr T static_value_cast(const homekit_value_t& value) noexcept;
template<typename T>
constexpr T static_value_cast(const homekit_characteristic_t* ch) noexcept;


/* Cast a homekit_value_t to a specific type reference
* @param value The homekit_value_t to cast
* @return The value of the homekit_value_t as the specific type
* @example static_value_ref_cast<bool>(value) = true
* @see modify_value<T>
* @note Only available for types that has a location in the homekit_value_t-union
*/
template<typename T>
constexpr T& static_value_ref_cast(homekit_value_t& value) noexcept;

/* Cast a specific type to a homekit_value_t
* @param value The value to cast
* @return The value as a homekit_value_t
* @example homekit_value_t value = static_value_cast(true);
*/
template<typename T>
constexpr homekit_value_t static_value_cast(T value) noexcept;


#pragma region Implementation
/* homekit_characteristic_t */
template<typename T>
constexpr T static_value_cast(const homekit_characteristic_t* ch) noexcept
{
  return static_value_cast<T>(ch->value);
}

/* bool <-> homekit_value_t */
template<> constexpr bool static_value_cast<bool>(const homekit_value_t& value) noexcept
{
  return value.bool_value;
}
template<> constexpr bool& static_value_ref_cast<bool>(homekit_value_t& value) noexcept
{
  return value.bool_value;
}
template<> constexpr homekit_value_t static_value_cast<bool>(bool value) noexcept
{
  return HOMEKIT_BOOL(value);
}

/* int <-> homekit_value_t */
template<> constexpr int static_value_cast<int>(const homekit_value_t& value) noexcept
{
  return value.int_value;
}
template<> constexpr int& static_value_ref_cast<int>(homekit_value_t& value) noexcept
{
  return value.int_value;
}
template<> constexpr homekit_value_t static_value_cast<int>(int value) noexcept
{
  return HOMEKIT_INT(value);
}


/*  uint8 <-> homekit_value_t */
template<> constexpr uint8_t static_value_cast<uint8_t>(const homekit_value_t& value) noexcept
{
  return value.uint8_value;
}
template<> constexpr uint8_t& static_value_ref_cast<uint8_t>(homekit_value_t& value) noexcept
{
  return value.uint8_value;
}
template<> constexpr homekit_value_t static_value_cast<uint8_t>(uint8_t value) noexcept
{
  return HOMEKIT_UINT8(value);
}

/*  uint16_t <-> homekit_value_t */
template<> constexpr uint16_t static_value_cast<uint16_t>(const homekit_value_t& value) noexcept
{
  return value.uint16_value;
}
template<> constexpr uint16_t& static_value_ref_cast<uint16_t>(homekit_value_t& value) noexcept
{
  return value.uint16_value;
}
template<> constexpr homekit_value_t static_value_cast<uint16_t>(uint16_t value) noexcept
{
  return HOMEKIT_UINT16(value);
}

/*  uint32_t <-> homekit_value_t */
template<> constexpr uint32_t static_value_cast<uint32_t>(const homekit_value_t& value) noexcept
{
  return value.uint32_value;
}
template<> constexpr uint32_t& static_value_ref_cast<uint32_t>(homekit_value_t& value) noexcept
{
  return value.uint32_value;
}
template<> constexpr homekit_value_t static_value_cast<uint32_t>(uint32_t value) noexcept
{
  return HOMEKIT_UINT32(value);
}

/*  uint64_t <-> homekit_value_t */
template<> constexpr uint64_t static_value_cast<uint64_t>(const homekit_value_t& value) noexcept
{
  return value.uint64_value;
}
template<> constexpr uint64_t& static_value_ref_cast<uint64_t>(homekit_value_t& value) noexcept
{
  return value.uint64_value;
}
template<> constexpr homekit_value_t static_value_cast<uint64_t>(uint64_t value) noexcept
{
  return HOMEKIT_UINT64(value);
}

/*  float <-> homekit_value_t */
template<> constexpr float static_value_cast<float>(const homekit_value_t& value) noexcept
{
  return value.float_value;
}
template<> constexpr float& static_value_ref_cast<float>(homekit_value_t& value) noexcept
{
  return value.float_value;
}
template<> constexpr homekit_value_t static_value_cast<float>(float value) noexcept
{
  return HOMEKIT_FLOAT(value);
}

/*  char* <-> homekit_value_t */
template<> constexpr char* static_value_cast<char*>(const homekit_value_t& value) noexcept
{
  return value.string_value;
}
template<> constexpr char*& static_value_ref_cast<char*>(homekit_value_t& value) noexcept
{
  return value.string_value;
}
template<> constexpr homekit_value_t static_value_cast<char*>(char* value) noexcept
{
  return HOMEKIT_STRING(value);
}

/*  const char* <-> homekit_value_t */
template<> constexpr const char* static_value_cast<const char*>(const homekit_value_t& value) noexcept
{
  return value.cstring_value;
}
template<> constexpr const char*& static_value_ref_cast<const char*>(homekit_value_t& value) noexcept
{
  return value.cstring_value;
}
template<> constexpr homekit_value_t static_value_cast<const char*>(const char* value) noexcept
{
  return HOMEKIT_CSTRING(value);
}

/* HOMEKIT_TARGET_DOOR_STATE <-> homekit_value_t */
template<> constexpr HOMEKIT_TARGET_DOOR_STATE static_value_cast<HOMEKIT_TARGET_DOOR_STATE>(const homekit_value_t& value) noexcept
{
  return static_cast<HOMEKIT_TARGET_DOOR_STATE>(static_value_cast<uint8_t>(value));
}
template<> constexpr homekit_value_t static_value_cast<HOMEKIT_TARGET_DOOR_STATE>(HOMEKIT_TARGET_DOOR_STATE value) noexcept
{
  return static_value_cast(static_cast<uint8_t>(value));
}

/* HOMEKIT_CURRENT_DOOR_STATE <-> homekit_value_t */
template<> constexpr HOMEKIT_CURRENT_DOOR_STATE static_value_cast<HOMEKIT_CURRENT_DOOR_STATE>(const homekit_value_t& value) noexcept
{
  return static_cast<HOMEKIT_CURRENT_DOOR_STATE>(static_value_cast<uint8_t>(value));
}
template<> constexpr homekit_value_t static_value_cast<HOMEKIT_CURRENT_DOOR_STATE>(HOMEKIT_CURRENT_DOOR_STATE value) noexcept
{
  return static_value_cast(static_cast<uint8_t>(value));
}


