HolgerBurkarth/HomeKit-ESP8266/src/hb_homekit.h
//END Implementation
#pragma endregion

//END static_value_cast
#pragma endregion

#pragma region homekit_value_cast

/* Reads the homekit_value_t contained in homekit_characteristic_t directly,
* or uses a getter that may be present.
* @param ch The characteristic to cast, nullptr is tolerated
*/
homekit_value_t homekit_value_cast(const homekit_characteristic_t* ch);

/* Cast a homekit_value_t to a specific type
* @param value The homekit_value_t to cast
* @return The value of the homekit_value_t as the specific type
* @see convert_value<T>(const homekit_value_t&)
* @note Supported Types:
* - bool: true if "true", "TRUE", "1", "ON", "on"
* - float
* - int
* @example
*   homekit_value_t TextValue = static_value_cast<const char*>("ON");
*   ...
*   homekit_value_t BoolValue = homekit_value_cast<bool>(TextValue);
*/
template<typename T>
homekit_value_t homekit_value_cast(const homekit_value_t& value) noexcept;


//END homekit_value_cast
#pragma endregion

#pragma region safe_value_cast

/* Cast a homekit_value_t to a specific type
* @param value The homekit_value_t to cast
* @return The value of the homekit_value_t as the specific type.
*         If the value is not of the specific type, the default value is returned.
* @example bool b = safe_value_cast<bool>(value);
* @note The value is checked for the specific type.
*/
template<typename T>
constexpr T safe_value_cast(const homekit_value_t& value) noexcept;
template<typename T>
constexpr T safe_value_cast(const homekit_value_t* value) noexcept;

template<typename T>
constexpr T safe_value_cast(const homekit_characteristic_t* ch) noexcept;


#pragma region Implementation

template<typename T>
constexpr T safe_value_cast(const homekit_value_t& value) noexcept
{
  if(is_value_typeof<T>(value))
    return static_value_cast<T>(value);
  else
    return T{};
}

template<typename T>
constexpr T safe_value_cast(const homekit_value_t* value) noexcept
{
  if(!value) return T{};
  return safe_value_cast<T>(*value);
}

template<typename T>
constexpr T safe_value_cast(const homekit_characteristic_t* ch) noexcept
{
  return safe_value_cast<T>(static_value_cast(ch));
}

//END Implementation
#pragma endregion

//END safe_value_cast
#pragma endregion

#pragma region convert_value

/* Convert a homekit_value_t to a specific type
* @param value The value to convert
* @return The value of the homekit_value_t as the specific type
* @note Supported Types see homekit_value_cast<T>(const homekit_value_t&)
* @example
*   homekit_value_t TextValue = static_value_cast<const char*>("TRUE");
*   ...
*   bool b = convert_value<bool>(TextValue);
*/
template<typename T>
T convert_value(const homekit_value_t& value) noexcept
{
  return static_value_cast<T>(homekit_value_cast<T>(value));
}

#pragma endregion

#pragma region to_string

/* Convert a homekit_value_t to a string
* @param value The value to convert
* @param buffer The buffer to write the string to
* @param size The size of the buffer
* @see format_text
* @example
* - bool: "true" or "false"
*/
const char* to_string(const homekit_value_t& value, char* buffer, size_t size);

template<size_t N>
const char* to_string(const homekit_value_t& value, char(&buffer)[N])
{
  return to_string(value, buffer, N);
}

/* Convert a homekit_value_t to a string
* @param value The value to convert
* @return The string representation of the value
* @see format_text
*/
String to_string(const homekit_value_t& value);
inline String to_string(const homekit_characteristic_t& ch) { return to_string(ch.value); }

/* Special: Convert a homekit_characteristic_t to a string
* @param ch The characteristic to convert
* @return The string representation of the characteristic
* @see format_text
* @example "\"Position\" = 10"
*/
String to_string_debug(const homekit_characteristic_t* ch);

//END to_string
#pragma endregion

#pragma region modify_value / modify_value_and_notify

/* Change the value of a homekit_value_t
* @param value The homekit_value_t to change
* @param newValue The new value
* @return true if the value has changed, false otherwise
* @example modify_value(HomeKitValue, true);
* @see static_value_cast<T>
* @note All types that can be converted to a homekit_value_t using static_value_cast<>() can be used as NewValue.
* @example
*  - modify_value(Ch, homekit_value_t{});
*  - modify_value(Ch, true);
*  - modify_value(Ch, HOMEKIT_CURRENT_DOOR_STATE{});
*/
template<typename T>
constexpr bool modify_value(homekit_value_t& value, T newValue) noexcept;
bool modify_value(homekit_value_t& value, const homekit_value_t& newValue);

/* Change the value of a homekit_characteristic_t
* @param ch The characteristic to change
* @param newValue The new value
* @return true if the value has changed, false otherwise
* @see static_value_cast<T>, modify_value_and_notify
* @note All types that can be converted to a homekit_value_t using static_value_cast<>() can be used as NewValue.
* @example
*  - modify_value(Ch, homekit_value_t{});
*  - modify_value(Ch, true);
*  - modify_value(Ch, HOMEKIT_CURRENT_DOOR_STATE{});
*/
template<typename T>
bool modify_value(homekit_characteristic_t* ch, T newValue) noexcept;
bool modify_value(homekit_characteristic_t* ch, const homekit_value_t& newValue);

/* Change the value of a homekit_characteristic_t
* If the value changes, HomeKit clients are notified.
* @param ch The characteristic to change
* @param newValue The new value
* @return true if the value has changed, false otherwise
* @see static_value_cast<T>, modify_value, homekit_characteristic_notify
* @note All types that can be converted to a homekit_value_t using static_value_cast<>() can be used as NewValue.
* @example
*  - modify_value_and_notify(Ch, homekit_value_t{});
*  - modify_value_and_notify(Ch, true);
*  - modify_value_and_notify(Ch, HOMEKIT_CURRENT_DOOR_STATE{});
*/
template<typename T>
bool modify_value_and_notify(homekit_characteristic_t* ch, T newValue) noexcept;
bool modify_value_and_notify(homekit_characteristic_t* ch, const homekit_value_t& newValue);


#pragma region Implementation

