HolgerBurkarth/HomeKit-ESP8266/src/hb_homekit.h
template<typename T>
constexpr bool modify_value(homekit_value_t& value, T newValue) noexcept
{
  return modify_value
  (
    value,
    static_cast<const homekit_value_t&>(static_value_cast(newValue))
  );
}

template<typename T>
bool modify_value(homekit_characteristic_t* ch, T newValue) noexcept
{
  return modify_value
  (
    ch,
    static_cast<const homekit_value_t&>(static_value_cast(newValue))
  );
}

template<typename T>
bool modify_value_and_notify(homekit_characteristic_t* ch, T newValue) noexcept
{
  return modify_value_and_notify
  (
    ch,
    static_cast<const homekit_value_t&>(static_value_cast(newValue))
  );
}

#pragma endregion

//END modify_value
#pragma endregion


//END homekit_value - Support
#pragma endregion

#pragma region Invoker
/* A parameter for a function that can be called with a parameter.
*/
struct CInvokerParam
{
  enum { MaxArgCount = 1 };

  /* Prepare for possible future enhancements.*/
  std::array<const homekit_value_t*, MaxArgCount> Args{};

  constexpr CInvokerParam() = default;
  constexpr CInvokerParam(const homekit_value_t* arg) : Args{ arg } {}
};

/*
* @brief CInvoker is a function that can be called with a parameter.
* @see CController::InstallCmd, CController::SetVar
*/
using CInvoker = std::function<void(CInvokerParam)>;

#pragma endregion

#pragma region CTicker / CTickerSlots

#pragma region CTickerSlot
/* A symbol for a ticker slot.
* This makes it easier to deal with invalid values.
*/
class CTickerSlot
{
  static const uint8_t InvalidSlot = (uint8_t)~0;

  uint8_t mSlot{ InvalidSlot };

  constexpr CTickerSlot(uint8_t slot) : mSlot(slot) {}
public:
  constexpr CTickerSlot() {} // forbid implicit setting any slot

  /* Create a new slot.
  * @param slot The slot number
  */
  constexpr static CTickerSlot New(uint8_t slot) { return CTickerSlot(slot); }


  constexpr uint8_t Value() const { return mSlot; }

  void reset() { mSlot = InvalidSlot; }

  /* Check if the slot is valid.
  */
  constexpr operator bool() const { return mSlot != InvalidSlot; }


  constexpr bool operator==(const CTickerSlot& other) const { return mSlot == other.mSlot; }
  constexpr bool operator!=(const CTickerSlot& other) const { return mSlot != other.mSlot; }

  constexpr friend bool IsInvalidOrDisabled(const CTickerSlot& slot) { return !slot; }

};

using ticker_slot = CTickerSlot;
#pragma endregion

#pragma region CInterruptForbidder
/* Forbid interrupts in the constructor and allow them in the destructor.
* @note This is useful for critical sections.
*/
struct CInterruptForbidder
{
  inline CInterruptForbidder() noexcept { noInterrupts(); }
  inline ~CInterruptForbidder() noexcept { interrupts(); }
};

#pragma endregion

#pragma region CTicker
/* A timer that calls a function at regular intervals.
*/
struct CTicker
{
  #pragma region Types
  struct CEvent
  {
    uint32_t Calls{};
  };

  using OnTimerFunc = std::function<void(CEvent)>;

  #pragma endregion

  #pragma region Fields
  uint32_t mInterval{};
  uint32_t mLastTick{};
  uint32_t mCalls{};
  OnTimerFunc mOnTimer{};

  #pragma endregion

  #pragma region Construction
  CTicker() = default;
  CTicker(CTicker&&) = default;
  CTicker(const CTicker&) = delete;
  CTicker& operator=(const CTicker&) = delete;
  CTicker& operator=(CTicker&&) = default;


  CTicker(uint32_t interval, OnTimerFunc&& func)
    :
    mInterval(interval),
    mLastTick(millis()),
    mOnTimer(std::move(func))
  {
  }
  CTicker(uint32_t interval, std::function<void()>&& func)
    :
    CTicker(interval, [func](CEvent) { func(); })
  {
  }

  #pragma endregion

  #pragma region Operators

  /* Check if the timer is active and callable.
    */
  operator bool() const
  {
    return !!mOnTimer;
  }

  /* Call the timer function.
  * @param ms The current time in milliseconds.
  * @see OnTick
    */
  void operator ()(uint32_t ms)
  {
    OnTick(ms);
  }

  #pragma endregion

  #pragma region Methods

  #pragma region OnTick
  /* Call the timer function.
  * @param ms The current time in milliseconds.
  * @note The function is called only if the interval has elapsed.
  */
  void OnTick(uint32_t ms)
  {
    if(TimeOver(ms))
      Invoke(ms);
  }

  #pragma endregion

  #pragma region TimeOver
  /* Check if the interval has elapsed.
  */
  bool TimeOver(uint32_t ms) const
  {
    return ms - mLastTick >= mInterval;
  }

  #pragma endregion

  #pragma region Invoke
  /* Call the timer function.
  * @note Be sure mOnTimer is not nullptr.
  */
  void Invoke(uint32_t ms)
  {
    if(mOnTimer)
    {
      mLastTick = ms;
      mOnTimer(CEvent
        {
            .Calls = ++mCalls
        });
    }
  }

  #pragma endregion

  //END Methods
  #pragma endregion

};

#pragma endregion

#pragma region CTickerSlots
/* A collection of timers.
* @tparam Slots The number of slots (maximum = 254, see CTickerSlot)
* @tparam ContinuousEvents If true, the timer functions are called continuously.
* @tparam Locker The type of the locker to protect the slots.
*/
template<size_t Slots, bool ContinuousEvents = true, typename Locker = decltype(void()) >
class CTickerSlots
{
  #pragma region Fields
  std::array<CTicker, Slots> mSlots;

  #pragma endregion

  #pragma region Construction
public:
  CTickerSlots() = default;
  CTickerSlots(CTickerSlots&&) = default;
  CTickerSlots(const CTickerSlots&) = delete;
  CTickerSlots& operator=(const CTickerSlots&) = delete;
  CTickerSlots& operator=(CTickerSlots&&) = default;

  #pragma endregion

  #pragma region Methods

  #pragma region Start
  /* Start a timer in a slot.
  * @param slot
  * @param interval The interval in milliseconds
  * @param func The function to call
  * @return The slot index or (~0) if no slot is available.
  * @note If a slot is already in use, the old timer is stopped and the new one is started.
  */
  ticker_slot Start(ticker_slot slot, uint32_t interval, CTicker::OnTimerFunc&& func)
  {
    if(slot.Value() >= Slots) return {};
    Locker();
    mSlots[slot.Value()] = CTicker(interval, std::move(func));
    return slot;
  }

  uint32_t Start(ticker_slot slot, uint32_t interval, std::function<void()>&& func)
  {
    if(slot.Value() >= Slots) return {};
    Locker();
    mSlots[slot.Value()] = CTicker(interval, std::move(func));
    return slot;
  }

