HolgerBurkarth/HomeKit-ESP8266/src/hb_homekit.h
  ticker_slot Start(uint32_t interval, CTicker::OnTimerFunc&& func)
  {
    uint8_t i = 0;
    Locker();
    for(auto& Slot : mSlots)
    {
      if(!Slot)
      {
        Slot = CTicker(interval, std::move(func));
        return ticker_slot::New(i);
      }
      ++i;
    }
    return {};
  }

  uint32_t Start(uint32_t interval, std::function<void()>&& func)
  {
    uint8_t i = 0;
    Locker();
    for(auto& Slot : mSlots)
    {
      if(!Slot)
      {
        Slot = CTicker(interval, std::move(func));
        return ticker_slot::New(i);
      }
      ++i;
    }
    return {};
  }

  #pragma endregion

  #pragma region Stop
  /* Stop a timer in a slot.
  * @param slot
  * @note If the slot is not in use, nothing happens.
    */
  void Stop(ticker_slot slot)
  {
    if(slot.Value() >= Slots) return;
    Locker();
    mSlots[slot.Value()] = CTicker{};
  }

  #pragma endregion

  #pragma region OnTick
  /* Call the timer functions.
  * @param ms The current time in milliseconds.
  * @note The functions are called only if the interval has elapsed.
  */
  void OnTick(uint32_t ms)
  {
    for(auto& Slot : mSlots)
    {
      Locker();
      if(Slot && Slot.TimeOver(ms))
      {
        if(ContinuousEvents)
          Slot.Invoke(ms);
        else
        {
          //VERBOSE("CTickerSlots::OnTick: ContinuousEvents %u %u | %u", ms, Slot.mLastTick, Slot.mInterval);
          CTicker Temp = std::move(Slot);
          Slot = CTicker{};
          Temp.Invoke(ms);
        }
      }
    }
  }

  #pragma endregion


  //END Methods
  #pragma endregion

};

/* A collection of timers that are interrupt safe and can be used in an interrupt context.
* @note The timer functions are called continuously.
*/
template<size_t Slots, bool ContinuousEvents = true>
using CTickerSlots_InterruptSafe = CTickerSlots<Slots, ContinuousEvents = true, decltype(CInterruptForbidder()) >;

/* A collection of timers that are interrupt safe and can be used in an interrupt context.
* @note The timer functions are called only once.
*/
template<size_t Slots>
using COneShotTickerSlots_InterruptSafe = CTickerSlots_InterruptSafe<Slots, false>;

/* A collection of timers that are not interrupt safe.
* @note The timer functions are called only once.
*/
template<size_t Slots>
using COneShotTickerSlots = CTickerSlots<Slots, false>;

#pragma endregion


//END CTicker
#pragma endregion

#pragma region CTextEmitter / MakeTextEmitter /Stream
/*
* @brief
* Text blocks of more than 10 KB can occur, especially when building the html page,
* which consists of CSS, JavaScript, and html code.
* Data streams are used to avoid memory bottlenecks.
* The @ref CTextEmitter type provides texts or strings that are read via a data stream.
*
* @example
        CTextEmitter MyBody()
        {
            return [](Stream& p) { p << "Hello World"; };
        }

--or--

        CTextEmitter MyCSS()
        {
            return MakeTextEmitter(F("b { color: red; }"));
        }
*/
using CTextEmitter = std::function<void(Stream&)>;

#pragma region operator<<(Stream&, ...)
/* Allows CTextEmitter to be used with the << operator,
* as already possible with (const char*) and other data.
* @func The CTextEmitter to stream. If nullptr, nothing is streamed.
* @example
*  extern CTextEmitter HtmlBody();
*  out << HtmlBody();
*/
inline Stream& operator<<(Stream& p, CTextEmitter func)
{
  if(func)
    func(p);
  return p;
}

/* Current, 2024-09-18, add missing overload for string.
*   @see StreamDev.h
* @example
*  extern const String& HtmlBody;
*  out << HtmlBody;
*/
inline Stream& operator << (Stream& out, const String& string)
{
  out.write(string.c_str(), string.length());
  return out;
}
inline Stream& operator << (Stream& out, float value)
{
  char buffer[32];
  out << dtostrf(value, 0, 2, buffer);
  return out;
}

#pragma endregion

#pragma region MakeTextEmitter
/* Create a CTextEmitter from a static text.
* @param text The text to stream
* @return The CTextEmitter
* @example CTextEmitter HtmlBody = MakeTextEmitter(F("Hello World"));
*/
inline CTextEmitter MakeTextEmitter(const __FlashStringHelper* text)
{
  return [text](Stream& p) { p << text; };
}
inline CTextEmitter MakeTextEmitter(const String& text)
{
  return [text](Stream& p)
    { 
      //WARNING: Stream<<"" causes problems! : 2024-10-02 Core 3.1.2
      if(!text.isEmpty()) 
        p << text; 
    };
}
inline CTextEmitter MakeTextEmitter(String&& text)
{
  return [text = std::move(text)](Stream& p)
    {
      //WARNING: Stream<<"" causes problems! : 2024-10-02 Core 3.1.2
      if(!text.isEmpty())
        p << text;
    };

}
inline CTextEmitter MakeTextEmitter()
{
  return [](Stream&) {};
}

/* A TextEmitter is created by converting the argument into a string using to_string(),
* followed by the return as a TextEmitter. It is crucial that a check is made at
* compile time to see whether a suitable to_string() exists.
* @param value The value to convert to a string
* @return The TextEmitter
* @example CTextEmitter Text = MakeTextEmitter(&Switch.State);
*/
template<typename T, typename = decltype(to_string(std::declval<T>()))>
CTextEmitter MakeTextEmitter(const T& value)
{
  return [Text = to_string(value)](Stream& p) { p << Text; };
}

#pragma endregion

#pragma region to_string
/* Convert a CTextEmitter to a string
*/
inline String to_string(const CTextEmitter& text)
{
  StreamString Stream;
  if(text)
    text(Stream);
  return static_cast<String&&>(Stream);
}

#pragma endregion


//END CTextEmitter
#pragma endregion

#pragma region +Configuration Descriptions - CService / CAccessory / CConfig

#pragma region CService
/* A HomeKit service with a fixed number of characteristics
* @tparam Characteristic_Count The number of characteristics in the service
*/
template<int Characteristic_Count>
struct CService
{
  #pragma region Fields
  const homekit_characteristic_t* Characteristics[Characteristic_Count + 1]{};
  homekit_service_t Service;

  #pragma endregion

  #pragma region Construction

  #pragma region Specials
  CService(const CService&) = delete;
  CService(CService&&) = delete;

  /* Create a HomeKit service with a fixed number of characteristics
  * @param service The service definition
  * @param characteristics The characteristics of the service
  * @example CService<2> service{ { .type = HOMEKIT_SERVICE_SWITCH, .primary = true }, { &Characteristic1, &Characteristic2 } };
  */
private:
  constexpr CService
  (
    const homekit_service_t& service,
    std::initializer_list<const homekit_characteristic_t*> characteristics
  ) noexcept
    :
    Service
    {
      .id = service.id,
      .type = service.type,
      .hidden = service.hidden,
      .primary = service.primary,
      .characteristics{ Characteristics }
    }
  {
    // TODO: Check - Currently not supported by GCC
    //static_assert(Characteristic_Count == characteristics.size(), "Characteristic_Count != characteristics.size()");

    int i = 0;
    for(auto& c : characteristics)
      Characteristics[i++] = c;
  }

