HolgerBurkarth/HomeKit-ESP8266/src/hb_homekit.h
public:
  #pragma endregion

  #pragma region CService<2>(...)
  /* Create a HomeKit service with a fixed number of characteristics
  * @param service The service definition
  * @param c0, c1, ... The characteristics of the service
  */
  template<typename T = void, typename = std::enable_if_t<Characteristic_Count == 2, T>>
  constexpr CService
  (
    const homekit_service_t& service,
    const homekit_characteristic_t* c0,
    const homekit_characteristic_t* c1
  ) noexcept
    :
    CService{ service, { c0, c1 } }
  {}
  #pragma endregion

  #pragma region CService<3>(...)
  template<typename T = void, typename = std::enable_if_t<Characteristic_Count == 3, T>>
  constexpr CService
  (
    const homekit_service_t& service,
    const homekit_characteristic_t* c0,
    const homekit_characteristic_t* c1,
    const homekit_characteristic_t* c2
  ) noexcept
    :
    CService{ service, { c0, c1, c2 } }
  {}
  #pragma endregion

  #pragma region CService<4>(...)
  template<typename T = void, typename = std::enable_if_t<Characteristic_Count == 4, T>>
  constexpr CService
  (
    const homekit_service_t& service,
    const homekit_characteristic_t* c0,
    const homekit_characteristic_t* c1,
    const homekit_characteristic_t* c2,
    const homekit_characteristic_t* c3
  ) noexcept
    :
    CService{ service, { c0, c1, c2, c3 } }
  {}
  #pragma endregion

  #pragma region CService<5>(...)
  template<typename T = void, typename = std::enable_if_t<Characteristic_Count == 5, T>>
  constexpr CService
  (
    const homekit_service_t& service,
    const homekit_characteristic_t* c0,
    const homekit_characteristic_t* c1,
    const homekit_characteristic_t* c2,
    const homekit_characteristic_t* c3,
    const homekit_characteristic_t* c4
  ) noexcept
    :
    CService{ service, { c0, c1, c2, c3, c4 } }
  {}
  #pragma endregion

  #pragma region CService<6>(...)
  template<typename T = void, typename = std::enable_if_t<Characteristic_Count == 6, T>>
  constexpr CService
  (
    const homekit_service_t& service,
    const homekit_characteristic_t* c0,
    const homekit_characteristic_t* c1,
    const homekit_characteristic_t* c2,
    const homekit_characteristic_t* c3,
    const homekit_characteristic_t* c4,
    const homekit_characteristic_t* c5
  ) noexcept
    :
    CService{ service, { c0, c1, c2, c3, c4, c5 } }
  {}
  #pragma endregion

  //END Construction
  #pragma endregion

  #pragma region Operators
  /* Get the address of the service
  * @return The address of the service
  * @example const homekit_service_t* service = &Service;
  */
  constexpr const homekit_service_t* operator&() const noexcept
  {
    return &Service;
  }


  CService& operator=(const CService&) = delete;
  CService& operator=(CService&&) = delete;

  #pragma endregion

};
#pragma endregion

#pragma region CAccessory
/* A HomeKit accessory with a fixed number of services
* @tparam Service_Count The number of services in the accessory
* @example

    const CAccessory<2> Accessory1
    {
      {
        //.id = 1,
        .category = homekit_accessory_category_switch,
        //.config_number = 1,
      },

      &Device,
      &Switch
    };

*/
template<int Service_Count>
struct CAccessory
{
  #pragma region Fields
  const homekit_service_t*  Services[Service_Count + 1]{};
        homekit_accessory_t Accessory{};

  #pragma endregion

  #pragma region Construction

  #pragma region Specials
  CAccessory(const CAccessory&) = delete;
  CAccessory(CAccessory&&) = delete;

  /* Create a HomeKit accessory with a fixed number of services
  * @param accessory The accessory definition
  * @param services The services of the accessory
  * @example CAccessory<2> accessory{ { .id = 1, .category = homekit_accessory_category_switch, .config_number = 1, .services{ &Service1, &Service2 } };
  */
private:
  constexpr CAccessory
  (
    const homekit_accessory_t& accessory,
    std::initializer_list<const homekit_service_t*> services
  ) noexcept
    :
    Accessory
    {
      .id = accessory.id ? accessory.id : 1,
      .category = accessory.category,
      .config_number = accessory.config_number ? accessory.config_number : 1,
      .services{ Services }
    }
  {
    // TODO: Check - Currently not supported by GCC
    //static_assert(Service_Count == services.size(), "Service_Count != services.size()");

    int i = 0;
    for(auto& s : services)
      Services[i++] = s;
  }

public:
  constexpr CAccessory() {}

  #pragma endregion

  #pragma region CAccessory<2>(...)
  /* Create a HomeKit accessory with a fixed number of services
  * @param accessory The accessory definition
  * @param s0, s1, ... The services of the accessory
  */
  template<typename T = void, typename = std::enable_if_t<Service_Count == 2, T>>
  constexpr CAccessory
  (
    const homekit_accessory_t& accessory,
    const homekit_service_t* s0,
    const homekit_service_t* s1
  ) noexcept
    : CAccessory{ accessory, { s0, s1 } }
  {}

  #pragma endregion

  #pragma region CAccessory<3>(...)
  template<typename T = void, typename = std::enable_if_t<Service_Count == 3, T>>
  constexpr CAccessory
  (
    const homekit_accessory_t& accessory,
    const homekit_service_t* s0,
    const homekit_service_t* s1,
    const homekit_service_t* s2
  ) noexcept
    : CAccessory{ accessory, { s0, s1, s2 } }
  {}
  #pragma endregion


  //END Construction
  #pragma endregion

  #pragma region Operators
  /* Get the address of the accessory
  * @return The address of the accessory
  * @example const homekit_accessory_t* accessory = &Accessory;
  */
  constexpr const homekit_accessory_t* operator&() const noexcept
  {
    return &Accessory;
  }

  CAccessory& operator=(const CAccessory&) = delete;
  CAccessory& operator=(CAccessory&&) = delete;

  #pragma endregion

};
#pragma endregion

#pragma region CConfig
/* A HomeKit configuration with a fixed number of accessories
* @tparam Accessory_Count The number of accessories in the configuration
* @example

    const CConfig<1> config
    {
      {
        .password = "111-11-111"
      },

      &Accessory1
    };

*/
template<int Accessory_Count>
struct CConfig
{
  #pragma region Fields
  const homekit_accessory_t*    Accessories[Accessory_Count + 1]{};
        homekit_server_config_t Config{};
        char                    Password[12]{};

  #pragma endregion

  #pragma region Construction

  #pragma region Specials
  CConfig(const CConfig&) = delete;
  CConfig(CConfig&&) = delete;

