HolgerBurkarth/HomeKit-ESP8266/src/hb_homekit.h
private:
  /* Create a HomeKit configuration with a fixed number of accessories
  * @param config The configuration definition
  * @param accessories The accessories of the configuration
  * @example CConfig<2> config{ { .accessories{ &Accessory1, &Accessory2 }, .category = homekit_accessory_category_switch, .config_number = 1, .password
  */
  CConfig
  (
    const homekit_server_config_t& config,
    std::initializer_list<const homekit_accessory_t*> accessories
  ) noexcept
  :
    Config
    {
      .accessories{ Accessories },
      .category = config.category ? config.category : (*accessories.begin())->category,
      .config_number = config.config_number ? config.config_number : (*accessories.begin())->config_number,
      .password = Password,
      .password_callback = config.password_callback,
      .setupId = config.setupId,
      .on_resource = config.on_resource,
      .on_event = config.on_event
    }
  {
    // TODO: Check - Currently not supported by GCC
    //static_assert(Accessory_Count == accessories.size(), "Accessory_Count != accessories.size()");

    int k, i = 0;
    for(auto& s : accessories)
      Accessories[i++] = s;

    /*
    * @note Pattern "111-11-111"
    */
    for(k = 0, i = 0; i < sizeof(Password) - 1 - 1 && config.password[k]; ++k)
    {
      if(config.password[k] != '-')
      {
        if(i == 3 || i == 6)
          Password[i++] = '-';
        Password[i++] = config.password[k];
      }
    }
    Password[i] = 0;
  }

public:
  constexpr CConfig() {}

  #pragma endregion

  #pragma region CConfig<1>(...)
  /* Create a HomeKit configuration with a fixed number of accessories
  * @param config The configuration definition
  * @param a0, a1, ... The accessories of the configuration
  */
  template<typename T = void, typename = std::enable_if_t<Accessory_Count == 1, T>>
  constexpr CConfig
  (
    const homekit_server_config_t& config,
    const homekit_accessory_t* a0
  ) noexcept
    : CConfig{ config, { a0 } }
  {}

  #pragma endregion

  #pragma region CConfig<2>(...)
  template<typename T = void, typename = std::enable_if_t<Accessory_Count == 2, T>>
  constexpr CConfig
  (
    const homekit_server_config_t& config,
    const homekit_accessory_t* a0,
    const homekit_accessory_t* a1
  ) noexcept
    : CConfig{ config, { a0, a1 } }
  {}

  #pragma endregion


  //END Construction
  #pragma endregion

  #pragma region Operators
  constexpr const homekit_server_config_t* operator&() const noexcept
  {
    return &Config;
  }

  CConfig& operator=(const CConfig&) = delete;
  CConfig& operator=(CConfig&&) = delete;

  #pragma endregion
};

#pragma endregion


//END Configuration Descriptions
#pragma endregion

#pragma region +Logging - Classes

#pragma region ILoggingEnumerator
/* Interface for an enumerator of log lines.
* @example
*       ILoggingEnumerator_Ptr enumerator = GetLoggingEnumerator();
*       if(enumerator)
*       {
*         while(enumerator->Next())
*         {
*           const char* line = enumerator->Current();
*           Serial.println(line);
*         }
*       }
*/
struct ILoggingEnumerator
{
  virtual ~ILoggingEnumerator() = default;
  virtual bool Next() = 0;
  virtual const char* Current() const = 0;
};

using ILoggingEnumerator_Ptr = std::unique_ptr<ILoggingEnumerator>;
#pragma endregion

#pragma region ILogging
/* Interface for a logging object.
* @see InstallLogging, GetLoggingEnumerator
*/
struct ILogging
{
  virtual ~ILogging() = default;
  virtual void NewLine() = 0;
  virtual void AddLine(const char* text) = 0;
  virtual void AddLine(const String& text) { AddLine(text.c_str()); }
  virtual void Add(char c) = 0;
  virtual void Add(const char* text) = 0;
  virtual void Clear() = 0;
  virtual ILoggingEnumerator_Ptr GetEnumerator() const = 0;
  virtual String GetLine(uint32_t id) const = 0;

};

using ILogging_Ptr = std::unique_ptr<ILogging>;
extern ILogging_Ptr gbLogging;

#pragma endregion

#pragma region CLogging
/* A logging object with a fixed number of lines and characters per line.
* @see InstallLogging, GetLoggingEnumerator
*/
template<size_t MaxLines = 60, size_t CharsPerLine = 128>
class CLogging : public ILogging
{
  #pragma region Fields
  using Cline = std::array<char, CharsPerLine + 1>;
  std::vector<Cline> mBuffer;
  uint16_t mEndIndex{};
  bool mFull{};
  bool mNeedClearLine{};

public:
  #pragma endregion

  #pragma region CEnumerator
  struct CEnumerator : ILoggingEnumerator
  {
    CLogging& mLogging;
    size_t mIndex;
    size_t mCount;

    CEnumerator(const CLogging& logging, size_t index, size_t count)
      :
      mLogging(const_cast<CLogging&>(logging)),
      mIndex(index),
      mCount(count)
    {
    }

    size_t LineIndex() const
    {
      return mIndex;
    }

    virtual bool Next() override
    {
      if(mCount == 0)
        return false;
      --mCount;
      if(++mIndex >= MaxLines)
        mIndex = 0;

      // terminate the string
      auto& Line = mLogging.mBuffer[LineIndex()];
      Line.data()[Line.size() - 1] = 0;
      return true;
    }

    virtual const char* Current() const override
    {
      return mLogging.mBuffer[LineIndex()].data();
    }

  };

  #pragma endregion

  #pragma region Construction
  CLogging(const CLogging&) = delete;
  CLogging(CLogging&&) = delete;
  CLogging& operator=(const CLogging&) = delete;
  CLogging& operator=(CLogging&&) = delete;

  CLogging()
  {
    mBuffer.resize(MaxLines);
    Clear();
  }

  #pragma endregion

  #pragma region Public Methods

  #pragma region NewLine
  virtual void NewLine() override
  {
    ++mEndIndex;
    if(mEndIndex >= MaxLines)
    {
      mEndIndex = 0;
      mFull = true;
    }

    mNeedClearLine = true;
  }
  #pragma endregion

  #pragma region AddLine
  virtual void AddLine(const char* text) override
  {
    StrCatCurPos(text);
    NewLine();
  }

  #pragma endregion

  #pragma region Add
  virtual void Add(char c) override
  {
    char Buf[2] = { c, 0 };
    StrCatCurPos(Buf);
  }

  virtual void Add(const char* text) override
  {
    StrCatCurPos(text);
  }

  #pragma endregion

  #pragma region Clear
  virtual void Clear() override
  {
    mFull = false;
    mEndIndex = 0;
    for(auto& Line : mBuffer)
      Line.fill(0);
  }

  #pragma endregion

