HolgerBurkarth/HomeKit-ESP8266/src/hb_homekit.h
  #pragma region GetEnumerator
  virtual ILoggingEnumerator_Ptr GetEnumerator() const override
  {
    size_t Count, Cur;

    if(mFull)
    {
      Cur = mEndIndex;
      Count = MaxLines;
    }
    else
    {
      Cur = 0;
      Count = mEndIndex;
    }

    return std::make_unique<CEnumerator>(*this, Cur, Count);
  }

  #pragma endregion

  #pragma region  GetLine
  virtual String GetLine(uint32_t id) const
  {
    if(id >= MaxLines)
      return String();
    if(mFull)
      id += mEndIndex;

    return String(mBuffer[id % MaxLines].data());
  }
  #pragma endregion



  //END Public Methods
  #pragma endregion

  #pragma region Private Methods
private:

  void ClearLineIfNeeded()
  {
    if(mNeedClearLine)
    {
      mNeedClearLine = false;
      mBuffer[mEndIndex][0] = 0;
    }
  }

  void StrCatCurPos(const char* src)
  {
    auto& Line = mBuffer[mEndIndex];
    ClearLineIfNeeded();
    strncat(Line.data(), src, Line.size() - 1);
  }


  //END Private Methods
  #pragma endregion

};

#pragma endregion

//END Logging
#pragma endregion

#pragma region +Password/Connection - Classes

#pragma region IPasswordEnumerator
/* Interface for an enumerator of SSID/password pairs. */
struct IPasswordEnumerator
{
  virtual ~IPasswordEnumerator() = default;

  /* Reset the enumerator to the first element.   */
  virtual void Reset() = 0;

  /* Move to the next element.*/
  virtual bool Next() = 0;

  /* Get the SSID of the current element. */
  virtual String GetSSID() const = 0;

  /* Get the password of the current element. */
  virtual String GetPassword() const = 0;

  /* The (current) ssid and password was accepted. */
  virtual void Accepted() = 0;

};

using IPasswordEnumerator_Ptr = std::shared_ptr<IPasswordEnumerator>;

#pragma endregion

#pragma region CStaticPasswordEnumerator
/* Password of SSID/password pairs
* @see CreatePasswordEnumerator
*/
template<typename TableType>
struct CStaticPasswordEnumerator : IPasswordEnumerator
{
  #pragma region Fields
  using const_iterator = typename TableType::const_iterator;

  TableType       mTab;
  const_iterator  mItr;
  const_iterator  mNext;

  #pragma endregion

  #pragma region Construction
  constexpr CStaticPasswordEnumerator(TableType loginTab) noexcept
    : mTab(loginTab)
    , mItr(mTab.end())
    , mNext(mTab.end())
  {
  }

  #pragma endregion

  #pragma region Properties
  const_iterator begin() const noexcept { return mTab.begin(); }
  const_iterator end() const noexcept { return mTab.end(); }

  #pragma endregion

  #pragma region Methods
  virtual void Reset() override
  {

    mItr = mTab.end();
    mNext = mTab.begin();
  }

  virtual bool Next() override
  {
    if(mNext == end())
      return false;

    mItr = mNext;
    ++mNext;
    return true;
  }

  virtual String GetSSID() const override
  {
    return std::get<0>(*mItr);
  }

  virtual String GetPassword() const override
  {
    return std::get<1>(*mItr);
  }

  virtual void Accepted() override
  {
  }

  #pragma endregion
};

#pragma endregion

#pragma region CWiFiConnection
/* Class for connecting to a WiFi network. */
class CWiFiConnection
{
  #pragma region Types

  /*
      enum WiFiMode_t
      {
              WIFI_OFF = 0, WIFI_STA = 1, WIFI_AP = 2, WIFI_AP_STA = 3
      };

  */


  //END Types
  #pragma endregion

  #pragma region Fields
  IPasswordEnumerator_Ptr     mPasswordEnumerator;
  uint32_t                    mConnectingTimeout;
  WiFiMode_t                  mRecomendedMode;
  Ticker                      mDnsTicker;
  std::unique_ptr<DNSServer>  mDNSServer;
  bool                        mInUse{};

  static WiFiMode_t mCurrentMode;
public:
  #pragma endregion

  #pragma region CParams
  struct CParams
  {
    IPasswordEnumerator_Ptr Password;
    uint32_t                Timeout{ 30 * 1000 };
    WiFiMode_t              RecomendedMode{ WIFI_STA };
  };

  #pragma endregion

  #pragma region Construction

  CWiFiConnection(CParams params) noexcept
    : mPasswordEnumerator(std::move(params.Password))
    , mConnectingTimeout(params.Timeout)
    , mRecomendedMode(params.RecomendedMode)
  {
  }

  #pragma endregion

  #pragma region Properties
  void SetPasswordEnumerator(IPasswordEnumerator_Ptr passwordEnumerator)
  {
    mPasswordEnumerator = std::move(passwordEnumerator);
  }

  bool HasPasswordEnumerator() const
  {
    return mPasswordEnumerator != nullptr;
  }

  WiFiMode_t GetRecomendedMode() const
  {
    return mRecomendedMode;
  }

  void SetRecomendedMode(WiFiMode_t mode)
  {
    mRecomendedMode = mode;
  }

  static WiFiMode_t GetCurrentMode()
  {
    return mCurrentMode;
  }

  String WifiInfoText() const;

  /* Called each time the connection is used and
  * indicates that the connection is in use.
  * @note Cleared by Connect(), STAConnect(), APConnect()
  */
  void SetInUse()
  {
    mInUse = true;
  }

  bool IsInUse() const
  {
    return mInUse;
  }

  //END Properties
  #pragma endregion

  #pragma region Static Methods
  static bool IsSTA(WiFiMode_t m) { return (m & WIFI_STA) != 0; }
  static bool IsAP(WiFiMode_t m) { return (m & WIFI_AP) != 0; }
  static bool IsSTA() { auto M = GetCurrentMode(); return !IsAP(M) && IsSTA(M); }
  static bool IsAP() { auto M = GetCurrentMode(); return !IsSTA(M) && IsAP(M); }

  #pragma endregion

  #pragma region Public Methods

  /* Connect to a WiFi network.
  * @return true if the connection was successful, false otherwise.
  * @note GetRecomendedMode is used to determine the mode.
  * @note CurrentMode is set to the mode.
    */
  bool Connect(bool tryMode = false);

  /* Connect to a WiFi network.
  * @return true if the connection was successful, false otherwise.
  * @note CurrentMode set to WIFI_STA
  * @note PasswordEnumerator is used to get the SSID and password.
    */
  bool STAConnect();

  /* Make local Wifi available.
  * @return true if the connection was successful, false otherwise.
  * @note If GetHomeKitConfig returns null or DeviceNameFrom, the default SSID = "ESP8266" and password = "12345678" are used.
  * @note   The password is taken from the GetHomeKitConfig. All "-" characters are removed.
  * @note The DeviceName is also used as the SSID. @see DeviceName()
  * @note CurrentMode set to WIFI_AP
  * @note Provide a DNS server for the captive portal.
    * @see https://www.qrcode-generator.de/solutions/wifi-qr-code/
    */
  bool APConnect();

  //END Public Methods
  #pragma endregion

