HolgerBurkarth/HomeKit-ESP8266/src/hb_homekit.h
  #pragma region Private Methods
private:

  /* Try to connect to a WiFi network.
  * @param ssid The SSID of the network.
  * @param password The password of the network.
  * @return true if the connection was successful, false otherwise.
    */
  bool TryConnectWiFi(const String& ssid, const String& password);

  //END Private Methods
  #pragma endregion


};

#pragma endregion

//END Password
#pragma endregion

#pragma region +WebSite

#pragma region CHtmlWebSiteMenuItem
struct CHtmlWebSiteMenuItem
{
  using CGetBool = std::function<bool()>;

  const char* Title{};    // Optional: Title of the website: e.g. "HomeKit Device"
  const char* MenuName{}; // Name of the menu item: e.g. "Settings"

  /* ID of the menu item (as URI).
  * "/" means the root menu
  * @note Must start with a slash!
  * @example "/settings"
  */
  const char* URI{};

  /* Pages that are smaller than 10kb must be marked.
  * @note Important for servers that do not support HTTP1.1 and the page
  * length must be known before sending. This means that the page
  * must be completely available in the main memory.  
  */
  bool        LowMemoryUsage{};

  /* Optional menu item ID (for easy access),
  * negative values are forbidden
  */
  int           ID{};
  bool          SpecialMenu{};      // Optional: e.g. right justified for "About"
  int           RefreshInterval{};  // Optional: Refresh (reload page) interval in seconds
  CTextEmitter  CSS;                // Optional: CSS for the website
  CTextEmitter  JavaScript;         // Optional: JavaScript for the website
  CTextEmitter  Body;               // The body of the website
  CGetBool      Visible;            // Optional ability to temporarily hide a menu.
};

#pragma endregion

#pragma region IHtmlWebSiteBuilder
struct IHtmlWebSiteBuilder
{
  #pragma region Types

  struct CHeaderParams
  {
    const char*   Title{};
    const char*   ExText{};
    CTextEmitter  CSS{};
    CTextEmitter  JavaScript{};
    int           RefreshInterval{};
  };

  struct CMenuStripItem
  {
    const char* Title{};
    const char* URI{};      // e.g. "/settings"
    bool        Selected{};
    bool        Special{};  // e.g. right justified for "About"
  };

  struct IMenuStripItems
  {
    virtual ~IMenuStripItems() = default;
    virtual bool Next() = 0;
    virtual CMenuStripItem Current() = 0;
  };

  #pragma endregion


  virtual ~IHtmlWebSiteBuilder() = default;

  virtual void Header(Stream&, CHeaderParams) = 0;
  virtual void Tail(Stream&) = 0;
  virtual void MenuStrip(Stream&, IMenuStripItems&) = 0;
  virtual void Body(Stream&, CTextEmitter) = 0;


};

using IHtmlWebSiteBuilder_Ptr = std::unique_ptr<IHtmlWebSiteBuilder>;

#pragma endregion


/* Create a new HTML web site builder. */
IHtmlWebSiteBuilder_Ptr CreateHtmlWebSiteBuilder();

//END WebSite
#pragma endregion

#pragma region CmdAttribute
/* Attributes for commands (@see CController::InstallCmd)
*/
enum CmdAttribute
{
  CmdAttr_None,
  CmdAttr_FirstSendPage, // Send page before executing the command
};

#pragma endregion

#pragma region CController
/* Deploy Web site, manage and use variables and commands:
*/
class CController
{
  #pragma region Public Types
public:
  static constexpr size_t MaxTickerSlots = 8;
  static constexpr size_t MaxOneShotTickerSlots = 5;

  /* Expander for variables (@see SetVar, ExpandVariables)
  */
  using Expander = std::function<CTextEmitter(CInvokerParam)>;

  #pragma region CCmdItem
  struct CCmdItem
  {
    CInvoker      Invoker;  // Command function
    String        Text;     // Command text (e.g. for html-code)
    CmdAttribute  Attr{};
  };

  #pragma endregion

  #pragma region CWiFiConnectionCtrl
  struct CWiFiConnectionCtrl
  {
    static constexpr uint32_t STAWatchDogTimeoutMS = 1 * 60 * 1000; // 1 minute
    static constexpr uint32_t APWatchDogTimeoutMS  = 5 * 60 * 1000; // 5 minutes

    CController&  mCtrl;

    CWiFiConnectionCtrl(CController& ctrl)
      : mCtrl(ctrl)
    {
    }

    void ConnectOrDie();
  };

  #pragma endregion

  //END Public Types
  #pragma endregion

  #pragma region Private Types
private:
  struct CMenuStripItems; /* Enumerator for menu items */

  //END Private Types
  #pragma endregion

  #pragma region Private Fields
private:
  using CMD_Map = std::map<String, CCmdItem>;
  using VAR_Map = std::map<String, Expander>;
  using MENU_List = std::list<CHtmlWebSiteMenuItem>;

  MENU_List               mMenuItems;
  CMD_Map                 mCMDs;
  VAR_Map                 mVars;
  IHtmlWebSiteBuilder_Ptr mBuilder;
  CWiFiConnection&        mWifiConnection;

  /* Selected menu item index.
  * In the range of [0 .. mMenuItems.size()-1]
  */
  int mSelectedMenuIndex{};

  /* Only menus with low memory usage are visible.
  * @see CHtmlWebSiteMenuItem::LowMemoryUsage
  * @see SendHtmlPage
  */
  bool mOnlyLMUMenusVisible{};

  /* Disable all web requests.
  */
  bool mDisableWebRequests{};

  using const_menu_iterator = MENU_List::const_iterator;
  using const_cmd_iterator = CMD_Map::const_iterator;

  #pragma endregion

  #pragma region Public Fields
public:
  COneShotTickerSlots<MaxOneShotTickerSlots>  OneShotTicker;
  CTickerSlots<MaxTickerSlots>                Ticker;
  CWiFiConnectionCtrl                         WiFiCtrl;

  #pragma endregion

  #pragma region Construction
public:
  CController
  (
    CWiFiConnection& wifiConnection,
    IHtmlWebSiteBuilder_Ptr builder = CreateHtmlWebSiteBuilder()
  )
    : mWifiConnection{ wifiConnection }
    , mBuilder{ std::move(builder) }
    , WiFiCtrl{ *this }
  {
  }

  #pragma endregion

  #pragma region Properties

  /* Get the selected menu item.
  * @return The selected menu item or nullptr if no menu item is selected.
  * @see GetSelectedMenuItemIndex, SetSelectedMenuItemIndex
  */
  const CHtmlWebSiteMenuItem* GetSelectedMenuItem() const;

  /* Get the ID of the selected menu item.
  * @return The ID of the selected menu item or -1 if no menu item is selected.
  * @see GetSelectedMenuItem, SetSelectedMenuItemIndex
  * @note CHtmlWebSiteMenuItem::ID is used as ID
  */
  int GetSelectedMenuItemID() const;

  /* Get the index of the selected menu item. [0 ... mMenuItems.size()-1]
  * @return The index of the selected menu item or -1 if no menu item is selected.
  * @see GetSelectedMenuItem, SetSelectedMenuItemIndex
  */
  int GetSelectedMenuItemIndex() const { return mSelectedMenuIndex; }

  /* Set the selected menu item by index. [0 ... mMenuItems.size()-1]
  * @param index The index of the menu item to select.
  * @return true if the menu item was selected, false otherwise.
  * @see GetSelectedMenuItem, GetSelectedMenuItemIndex
  */
  bool SetSelectedMenuItemIndex(int index);


  //END Properties
  #pragma endregion

  #pragma region Public Methods

