HolgerBurkarth/HomeKit-ESP8266/src/hb_homekit.h
  #pragma region AddMenuItem
/* Add a menu item to the web site.
* @param item The menu item to add.
* @see AddDeviceMenu, AddLoggingMenu, AddWiFiLoginMenu
* @example
     AddMenuItem
     (
              {
                  .Title = "HomeKit Settings",
                  .MenuName = "Settings",
                  .URI = "/settings",
                  .Body = []() -> String
                  {
                      return F(R"(Html-Body text)");
                  },
              }
   );
  */
  CController& AddMenuItem(CHtmlWebSiteMenuItem&& item);

  #pragma endregion

  #pragma region InstallCmd
  /* Add a command that creates a button on the HTML page.
    * When the button is clicked, a function is performed.
  * @param cmd Name of the command.
    *            For better readability in HTML code, capital letters should always be used.
  *            Allowed literals: A-Z 0-9 and -_
  * @param func The function that is to be called when you click on the html button.
  * @see InvokeCMD, ExpandVariables
  * @example
            Source-Code:
                InstallCmd
                (
                    "TEST",
                    [](auto)
                    {
                        Serial.println("TEST pressed");
                    }
                );
                InstallCmd
                (
          "OPEN", "Open Door",
                    [](auto)
                    {
                        Serial.println("The door opens");
                    }
                );

            HTML Source-Code: (via CHtmlWebSiteMenuItem::Body)
        {FORM_CMD:TEST} {FORM_CMD:OPEN}

      Webbrowser:
        <button type='submit' name='CMD' value='TEST'>TEST</button>
        <button type='submit' name='CMD' value='OPEN'>Open Door</button>
    */
  CController& InstallCmd(const char* cmd, CInvoker&& func);
  CController& InstallCmd(const char* cmd, CmdAttribute attr, CInvoker&& func);
  CController& InstallCmd(const char* cmd, const char* text, CInvoker&& func);
  CController& InstallCmd(const char* cmd, const char* text, CmdAttribute attr, CInvoker&& func);

  #pragma endregion

  #pragma region SetVar
  /* Add a variable that will be expanded during HTML body generation.
* @param var Name of the variable.
*            For better readability in HTML code, capital letters should always be used.
*            Allowed literals: A-Z 0-9 and -_
* @param expander The function that expands the variable.
* @param content The content of the variable.
* @see ExpandVariables, TryGetVar
* @example
    SetVar
    (
      "VAR",
      [](auto param)
      {
        return MakeTextEmitter(F("VAR-Value"));
      }
    );
  --or--
    SetVar("VAR", "VAR-Value");
  */
  CController& SetVar(const char* var, Expander&& expander);
  CController& SetVar(const String& var, Expander&& expander);
  CController& SetVar(const char* var, String content);
  CController& SetVar(const String& var, String content);

  #pragma endregion

  #pragma region TryGetVar
  /* Try to get the content of a variable.
  * @param var Name of the variable.
  * @param pContent The content of the variable. If the variable was not found, the content is emptyString.
  *              pContent is ignored if nullptr. In this case, only the return value is evaluated.
  * @return true if the variable was found, false otherwise.
  * @see SetVar
  * @note: TryGetVar(name, nullptr) is used to check if a variable exists.
    */
  bool TryGetVar(const char* var, String* pContent, CInvokerParam param = {}) const;
  bool TryGetVar(const String& var, String* pContent, CInvokerParam param = {}) const;

  #pragma endregion

  #pragma region Setup
  /* Setup the controller. Must be called before using the controller.
    * Standard variables and commands are created. The web server is also prepared to serve the pages.
  * @see InstallStdVariables, InstallStdCMDs
  * @note CController::Setup() is also called.
  */
  void Setup();

  #pragma endregion

  #pragma region Loop
  void Loop(bool tickerEnabled = true);

  #pragma endregion

  #pragma region DisableWebRequests / EnableWebRequests

  void DisableWebRequests() { mDisableWebRequests = true; }
  void EnableWebRequests() { mDisableWebRequests = false; }

  #pragma endregion

  #pragma region IndexOfMenuURI
  /* Get the index of a menu item by URI.
  * @param uri The URI of the menu item. @see CHtmlWebSiteMenuItem::URI
  * @return The index of the menu item or -1 if the menu item was not found.
  */
  int IndexOfMenuURI(const char* uri) const;

  #pragma endregion

  #pragma region ForEachMenuItem / ForEachCmdName / ForEachVar
  /*
  * @param F func: Function to be called for each menu item: void func(const CHtmlWebSiteMenuItem& item)
  */
  template<typename F>
  void ForEachMenuItem(F func) const
  {
    for(auto& Item : mMenuItems)
      func(Item);
  }

  /* @param F func: Function to be called for each command name: void func(const String&)
  */
  template<typename F>
  void ForEachCmdName(F func) const
  {
    for(auto& Item : mCMDs)
      func(Item.first);
  }

  /* @param F func: Function to be called for each command: void func(const String& name, const String& content)
  */
  template<typename F>
  void ForEachVar(F func) const
  {
    for(auto& Item : mVars)
      func(Item.first, to_string(Item.second(nullptr)));
  }


  #pragma endregion

  #pragma region GetCmdText
  /* Get the text for a command
  * @param cmd The command
  * @return The text for the command.
  *         If the command has no text or no command named cmd is found,
  *         the return value is cmd.
  */
  const char* GetCmdText(const char* cmd) const;

  #pragma endregion

  #pragma region ExpandVariables
  /* Expand variables in the input text
  * @param _inputText The input text with variables
  * @note: Variables are enclosed in curly brackets, e.g. "{VarName:Args}"
  * @example
  *   "Today is {DATE}" -> "Today is 2024-09-12"
  */
  void ExpandVariables(Stream&, const String& _inputText) const;

  #pragma endregion

  #pragma region Debug-Helpers

