HolgerBurkarth/HomeKit-ESP8266/src/hb_homekit.h
  const CController& DebugPrintCMDs() const
  {
    Serial.println("CMDs:");
    ForEachCmdName
    (
      [](const String& cmd)
      {
        Serial.printf("\t\"%s\"\n", cmd.c_str());
      }
    );
    Serial.println();
    return *this;
  }

  const CController& DebugPrintVARs() const
  {
    Serial.println("VARs:");
    ForEachVar
    (
      [](const String& name, const String& content)
      {
        Serial.printf("\t\"%s\" = \"%s\"\n", name.c_str(), content.c_str());
      }
    );
    Serial.println();
    return *this;
  }

  const CController& DebugPrintMenuItems() const
  {
    Serial.println("MenuItems:");
    ForEachMenuItem
    (
      [](const CHtmlWebSiteMenuItem& item)
      {
        Serial.printf("\t\"%s\" = \"%s\"\n", item.MenuName, item.URI);
      }
    );
    Serial.println();
    return *this;
  }

  //END Debug-Helpers
  #pragma endregion


  //END Public Methods
  #pragma endregion

  #pragma region Private Methods
  void PerformWebServerRequest();
  void PerformWebServerVarRequest();

  #pragma region DispatchWebseverUriRequest
  /* Distributes a web server request, such as "/device" or "/log",
  * by determining the associated menu page and
  * then sending the (new) web page. @see AddMenuItem
  *
  * @param uri The URI of the request
  * @note:
  * If the URI contains a suffix such as .ico, then it is safe to say that
  * it is not a device-provided page and a 404 will be returned.
  *
  * @note:
  * If no menu item can be associated with the URI, 302 redirects to the root page.
  */
  void DispatchWebseverUriRequest(const char* uri);

  #pragma endregion

  #pragma region FindCMD
  /* Find a command by name.
  * @param cmd The name of the command.
  * @return The iterator to the command or mCMDs.end() if the command was not found.
  */
  const_cmd_iterator FindCMD(const String& cmd) const;

  #pragma endregion

  #pragma region InvokeCMD
  /* Invoke a command by its name
  * @param cmdItr The command iterator @see FindCMD
  * @param cmd The command name
  */
  void InvokeCMD(const_cmd_iterator cmdItr, const String& cmd, CInvokerParam param = {});

  #pragma endregion

  #pragma region InstallStdCMDs
  /* Install standard commands
  * @example {FORM_BEGIN} Commands: {FORM_CMD:REBOOT} {FORM_CMD:RESET_PAIRING} {FORM_END}
  * @note:
  * - REBOOT
  *   Reboots the device
  *
  * - RESET_PAIRING
  *   Resets the HomeKit pairing and restarts the device
  */
  void InstallStdCMDs();

  #pragma endregion

  #pragma region InstallStdVariables
  /* Install standard variables
  * @see ExpandVariables
  * @note: The following standard variables are installed:
  * - LOCAL_IP
  *   The IP address of the device

  * - REMOTE_IP
  *   The IP address of the remote client
  *
  * - MAC
  *   The MAC address of the device
  *
  * - DEVICE_NAME
  *   The name of the device
  *
  * - IS_PAIRED
  *   "Yes" if the device is paired with HomeKit, otherwise "No"
  *
  * - CLIENT_COUNT
  *   The number of connected clients
  *
  * - FORM_CMD:cmdName
  *   A button to execute a command
  *   @example {FORM_CMD:REBOOT}
  *       @see FORM_BEGIN, FORM_END
  *
  * - FORM_BEGIN
  *   Start of a command form
  *   @example {FORM_BEGIN} Command: {FORM_CMD:REBOOT} {FORM_END}
  *   @see FORM_END
  *
  * - FORM_END
  *   End of a command form
  *   @see FORM_BEGIN
  *
  * - PARAM_TABLE_BEGIN
  *   Start of a parameter table
  *   @see PARAM_TABLE_END
  *   @example
  *               {PARAM_TABLE_BEGIN}
  *                   <tr><th>IP</th><td>{IP}</td></tr>
  *                   <tr><th>MAC</th><td>{MAC}</td></tr>
  *               {PARAM_TABLE_END}
  *
  * - PARAM_TABLE_END
  *   End of a parameter table
  *   @see PARAM_TABLE_BEGIN
  *
  * - HTML_LOG
  *   A table with log entries
  *
  * - DATE
  *  The current date (YYYY-MM-DD)
  *
  * - TIME
  *  The current time (HH:MM:SS)
  *
  * - FORMAT_FILESYSTEM
  *  Formats the file system. @see CSimpleFileSystem
  *
  *
  */
  void InstallStdVariables();

  #pragma endregion

  #pragma region SendHtmlPage
  /* Send the HTML page for the currently selected menu.
    * The Html page for the currently selected menu is created using the HtmlWebSiteBuilder.
    */
  void SendHtmlPage();
  void SendHtmlPage(Stream&) const;

  #pragma endregion


  //END Private Methods
  #pragma endregion

};

//END CController
#pragma endregion

#pragma region CSimpleFileSystem
/* File system for storing files in the EEPROM.
 * @note This instance cannot allocate on the stack because it is too large.
 * The file system is organized as follows:
 * - The file system is stored in the EEPROM.
 * - Files can only be overwritten with the length they had at creation.
 * - Filename must be 4 characters long.
*/
class CSimpleFileSystem
{
  #pragma region Types
  enum
  {
    MaxTableEntries = 16,
    NameLength = 4,
    EpromPageSize = 4096, // @see SPI_FLASH_SEC_SIZE

    /* 2024-09-17 HB: May not be #0, otherwise the data will not be stored in the EPROM for unknown reasons. */
    EpromPage = 1
  };

  struct CEntry
  {
    uint8_t  Name[NameLength];
    uint16_t StartOffset;
    uint16_t Size;
  };

  struct CPage
  {
    uint32_t Crc;
    CEntry   Entries[MaxTableEntries];
    uint8_t  Memory[EpromPageSize - MaxTableEntries * sizeof(CEntry) - sizeof(uint32_t)];
  };

  #pragma endregion

  #pragma region Fields
  CPage     mPage;
  size_t    mUsedMemorySize{};
  bool      mWriteBackNeeded{};
  uint8_t   mModifyCounter{};

  #pragma endregion

  #pragma region Construction
public:
  CSimpleFileSystem(const CSimpleFileSystem&) = delete;
  CSimpleFileSystem& operator=(const CSimpleFileSystem&) = delete;
  CSimpleFileSystem(CSimpleFileSystem&&) = delete;
  CSimpleFileSystem& operator=(CSimpleFileSystem&&) = delete;


  CSimpleFileSystem()
  {
    ReadPageOrFormat();
  }
  ~CSimpleFileSystem()
  {
    Sync();
  }

  #pragma endregion

  #pragma region CFileEnumerator
  class CFileEnumerator
  {
    #pragma region Fields
    const CSimpleFileSystem& mFS;
    char    mName[NameLength + 1];
    uint8_t mBeginModifyCounter;
    int     mIndex = -1;

    #pragma endregion

    #pragma region Construction
  public:
    CFileEnumerator(const CSimpleFileSystem& FS)
      : mFS(FS)
      , mBeginModifyCounter(FS.mModifyCounter)
    {
    }

    #pragma endregion

    #pragma region Next
    bool Next();

    #pragma endregion

    #pragma region Current
    const char* Current() const
    {
      return mName;
    }

    #pragma endregion

