HolgerBurkarth/HomeKit-ESP8266/src/hb_homekit.h
  };

  //END CFileEnumerator
  #pragma endregion

  #pragma region Properties
  /* If checks whether the FS is empty, i.e. no files are noted
* @return True if the FS is empty.
  */
  bool empty() const
  {
    return mUsedMemorySize == 0;
  }

  #pragma endregion

  #pragma region Public Methods

  #pragma region Files
  /* Enumerates the files in the file system.
   * @return The file enumerator.
  */
  CFileEnumerator Files() const
  {
    return CFileEnumerator(*this);
  }

  #pragma endregion

  #pragma region Sync
  /* Synchronizes the file system with the EEPROM.
   * This method is called automatically in the destructor.
  */
  void Sync();

  #pragma endregion

  #pragma region Exists
  /* Checks if a file exists.
   * @param pName The name of the file.
   * @return True if the file exists.
  */
  bool Exists(const char* pName) const
  {
    return FindEntry(pName) >= 0;
  }

  #pragma endregion

  #pragma region FileSize
  /* Gets the size of a file.
   * @param pName The name of the file.
   * @return The size of the file or -1 if the file does not exist.
  */
  int FileSize(const char* pName) const;

  #pragma endregion

  #pragma region ReadFile
  /* Reads a file.
   * @param pName The name of the file.
   * @param pBuf The buffer to read the file into.
   * @param Size The size of the buffer. Must be equal to the file size.
   * @return The number of bytes read or -1 if the file does not exist or the buffer is too small.
  */
  int ReadFile(const char* pName, uint8_t* pBuf, int Size);

  #pragma endregion

  #pragma region WriteFile
  /* Writes or creates a file.
   * @param pName The name of the file. Must be 4 characters long.
   * @param pBuf The buffer to write.
   * @param Size The size of the buffer. Must be equal to the file size if the file already exists.
   * @return The number of bytes written or -1 if the file system is full.
  */
  int WriteFile(const char* pName, const uint8_t* pBuf, int Size);

  #pragma endregion

  #pragma region Format
  /* Formats the file system.
  */
  void Format();
  #pragma endregion


  #pragma region List
  /* Lists the files in the file system.
  */
  void List();

  #pragma endregion


  //END Public Methods
  #pragma endregion

  #pragma region Private Methods
private:

  /* Touches the file system.
   * This method is called automatically when a file is modified.
  */
  void Touch();

  /* Reads the file system page from the EEPROM.
   * @return True if the page was read successfully.
  */
  bool ReadPage();

  /* Writes the file system page to the EEPROM.
   * @return True if the page was written successfully.
  */
  bool WritePage();

  /* Reads the file system page from the EEPROM or formats the file system if the page is invalid.
  */
  void ReadPageOrFormat();

  /* Finds an entry in the file system.
   * @param pName The name of the file or nullptr to find an empty slot.
   * @return The index of the entry or -1 if the entry was not found.
  */
  int FindEntry(const char* pName = nullptr) const;

  /* Debug prints the file system table.
  */
  void DebugPrintTable();



  //END Private Methods
  #pragma endregion

};

//END CSimpleFileSystem
#pragma endregion

#pragma region SimpleFileSystem
/* Allows the direct call of a method of the CSimpleFileSystem class.
*/
struct SimpleFileSystem
{
  static void Format()
  {
    auto FS = std::make_unique<CSimpleFileSystem>();
    FS->Format();
  }

  static int ReadFile(const char* pName, uint8_t* pBuf, int Size)
  {
    auto FS = std::make_unique<CSimpleFileSystem>();
    return FS->ReadFile(pName, pBuf, Size);
  }

  template<typename T>
  static bool ReadFile(const char* pName, T& p)
  {
    return ReadFile(pName, reinterpret_cast<uint8_t*>(&p), sizeof(T)) == sizeof(T);
  }

  static int WriteFile(const char* pName, const uint8_t* pBuf, int Size)
  {
    auto FS = std::make_unique<CSimpleFileSystem>();
    return FS->WriteFile(pName, pBuf, Size);
  }

  template<typename T>
  static bool WriteFile(const char* pName, const T& p)
  {
    return WriteFile(pName, reinterpret_cast<const uint8_t*>(&p), sizeof(T)) == sizeof(T);
  }

};
#pragma endregion


#pragma region +HomeKit - Services
/* More information about HomeKit services can be found at:
*           HomeKit_Switch.h
*           HomeKit_GarageDoorOpener.h
*/


#pragma region CDeviceService
/* A HomeKit device service
*  Contains the basic information of the device
*/
struct CDeviceService
{
  #pragma region Fields
  homekit_characteristic_t HKIdentity;
  homekit_characteristic_t HKManufacturer;
  homekit_characteristic_t HKModel;
  homekit_characteristic_t HKName;
  homekit_characteristic_t HKSerialNumber;
  homekit_characteristic_t HKFirmwareRevision;
  char HKDeviceName[64]{};

  CService<6> Service;

  #pragma endregion

  #pragma region BaseAccessories_t
  struct BaseAccessories_t
  {
    const char* DeviceName = "Device";
    uint16_t DeviceID{};
    const char* Model = "ESP8266/ESP32";
    const char* SerialNumber = "0123456";
    const char* FirmwareRevision = "1.0";
    const char* Manufacturer = "Holger Burkarth";
  };

  #pragma endregion

  #pragma region Construction
  CDeviceService(const CDeviceService&) = delete;
  CDeviceService(CDeviceService&&) = delete;

  /*
* @param base The base information of the device
* @example
      constexpr CDeviceService Device // http://Sample.local
      {
        .DeviceName{"Sample"},
      };
--or--
      constexpr CDeviceService Device // http://Sample5F0C.local
      {
        {
          .DeviceName{"Sample"},
          .DeviceID{0x5F0C}
          ...
        }
      };
--or--
      const CDeviceService Device // http://Sample????.local
      {
        {
          .DeviceName{"Sample"},
          .DeviceID{CDeviceService::MAC_DeviceID()}
          ...
        }
      };

   */
  constexpr CDeviceService(BaseAccessories_t base) noexcept
    :
    HKIdentity
    {
      .type = HOMEKIT_CHARACTERISTIC_IDENTIFY,
      .description = "Identify",
      .format = homekit_format_bool,
      .permissions = homekit_permissions_paired_read,
    },

    HKManufacturer{ HOMEKIT_DECLARE_CHARACTERISTIC_MANUFACTURER(base.Manufacturer) },
    HKModel{ HOMEKIT_DECLARE_CHARACTERISTIC_MODEL(base.Model) },
    HKName{ HOMEKIT_DECLARE_CHARACTERISTIC_NAME(HKDeviceName) },
    HKSerialNumber{ HOMEKIT_DECLARE_CHARACTERISTIC_SERIAL_NUMBER(base.SerialNumber) },
    HKFirmwareRevision{ HOMEKIT_DECLARE_CHARACTERISTIC_FIRMWARE_REVISION(base.FirmwareRevision) },

    Service
    {
      {
        .type = HOMEKIT_SERVICE_ACCESSORY_INFORMATION,
        .primary = true
      },

      &HKIdentity,
      &HKManufacturer,
      &HKModel,
      &HKName,
      &HKSerialNumber,
      &HKFirmwareRevision
    }
  {
    auto Digit = [](uint8_t c) -> char
      {
        return c < 10 ? '0' + c : 'A' + c - 10;
      };


    int i = 0;
    // Copy the device name
    for(; i < sizeof(HKDeviceName) - 1 - 4 && base.DeviceName[i]; ++i)
      HKDeviceName[i] = base.DeviceName[i];
    // add base.DeviceID to the device name as 4 HEX digits
    if(base.DeviceID != 0)
    {
      HKDeviceName[i++] = Digit(base.DeviceID >> 12 & 0xF);
      HKDeviceName[i++] = Digit(base.DeviceID >> 8 & 0xF);
      HKDeviceName[i++] = Digit(base.DeviceID >> 4 & 0xF);
      HKDeviceName[i++] = Digit(base.DeviceID & 0xF);
    }
    HKDeviceName[i] = 0;
  }
  #pragma endregion

  #pragma region Static Methods

  #pragma region MAC_DeviceID
  /* Get the device-id of the device.
* @example
        const CDeviceService Device
        {
            {
                .DeviceName{"Sample"},
                .DeviceID{CDeviceService::MAC_DeviceID()}
            }
        };

*/
  static uint16_t MAC_DeviceID()
  {
    uint8_t mac[6];
    WiFi.macAddress(mac);
    return (mac[4] << 8) | mac[5];
  }

  #pragma endregion

  //END Static Methods
  #pragma endregion

  #pragma region Operators
  constexpr const homekit_service_t* operator&() const noexcept
  {
    return &Service;
  }

  #pragma endregion

