HolgerBurkarth/HomeKit-ESP8266/src/hb_homekit.h
};

#pragma endregion



//END HomeKit - Services
#pragma endregion


#pragma region >>> CHomeKit <<<
/* HomeKit class.
* @note This class is a singleton.
*/
class CHomeKit
{
  #pragma region Private Fields
  CAccessory<2>                   mInnerAccessory;
  CConfig<1>                      mInnerConfig;
  const homekit_server_config_t*  mConfig{};

  CTicker     mLEDTimer;
  bool        mHomeKitServerStarted{};

  static bool mIsPaired; // True if HomeKit is paired (with Apple)
  #pragma endregion

  #pragma region Public Fields
public:
  CWiFiConnection WifiConnection;
  CController     Controller;

  #pragma endregion

  #pragma region Construction
public:
  CHomeKit(const CHomeKit&) = delete;
  CHomeKit(CHomeKit&&) = delete;
  CHomeKit& operator=(const CHomeKit&) = delete;
  CHomeKit& operator=(CHomeKit&&) = delete;

  #pragma region CHomeKit(&Config, ... )
  /*
  * @example
    CSwitchService Switch{ ... };

    const CDeviceService Device
    {
      .DeviceName{"Switch"},
    };

    const CAccessory<2> Accessory1
    {
      {
        .category = homekit_accessory_category_switch,
      },

      &Device,
      &Switch
    };


    const CConfig<1> gbConfig
    {
      {
        .password = "111-11-111"
      },

      &Accessory1
    };

    CHomeKit HomeKit(&gbConfig);

  */
  CHomeKit
  (
    const homekit_server_config_t* config,
    CWiFiConnection::CParams wifiPass = {},
    IHtmlWebSiteBuilder_Ptr builder = CreateHtmlWebSiteBuilder()
  )
    : mConfig(config)
    , WifiConnection(std::move(wifiPass))
    , Controller(WifiConnection, std::move(builder))
    , mLEDTimer{ 100, &UpdateBuildInLED }
  {
    Singleton = this;
  }

  #pragma endregion

  #pragma region CHomeKit(&Accessory, ...)
  /*
  * @example
    CAHTSensorService Sensor{ ... };

    const CDeviceService Device
    {
      .DeviceName{"Sensor"},
    };

    const CAccessory<3> gbAccessory
    {
      {
        .category = homekit_accessory_category_sensor,
      },

      &Device,
      Sensor[0],
      Sensor[1]
    };

    CHomeKit HomeKit(&gbAccessory);

  */
  CHomeKit
  (
    const homekit_accessory_t* pAccessory,
    CWiFiConnection::CParams wifiPass = {},
    IHtmlWebSiteBuilder_Ptr builder = CreateHtmlWebSiteBuilder()
  )
    : mInnerConfig{ {.password = "111-11-111"}, pAccessory }
    , mConfig(&mInnerConfig)
    , WifiConnection(std::move(wifiPass))
    , Controller(WifiConnection, std::move(builder))
    , mLEDTimer{ 100, &UpdateBuildInLED }
  {
    Singleton = this;
  }

  #pragma endregion

  #pragma region CHomeKit(Device, category, &Service, ...)
  /*
  * @example
    CSwitchService Switch{ ... };

    const CDeviceService Device
    {
      .DeviceName{"Switch"},
    };

    CHomeKit HomeKit(Device, homekit_accessory_category_switch, &Switch);
  */
  CHomeKit
  (
    const CDeviceService& device,
    homekit_accessory_category_t category,
    const homekit_service_t* pService,
    CWiFiConnection::CParams wifiPass = {},
    IHtmlWebSiteBuilder_Ptr builder = CreateHtmlWebSiteBuilder()
  )
    : mInnerAccessory{ {.category = category}, &device, pService }
    , mInnerConfig{ {.password = "111-11-111"}, &mInnerAccessory }
    , mConfig(&mInnerConfig)
    , WifiConnection(std::move(wifiPass))
    , Controller(WifiConnection, std::move(builder))
    , mLEDTimer{ 100, &UpdateBuildInLED }
  {
    Singleton = this;
  }

  #pragma endregion

  //END Construction
  #pragma endregion

  #pragma region Properties
  static CHomeKit* Singleton;

  #pragma region IsPaired
  /* Gets whether the device is HomeKit paired.
  * @return True if HomeKit is paired (with Apple)
  */
  static bool IsPaired()
  {
    if(!mIsPaired)
      mIsPaired = homekit_is_paired();
    return mIsPaired;
  }

  #pragma endregion

  #pragma region Config
  const homekit_server_config_t* Config() const
  {
    return mConfig;
  }
  #pragma endregion

  //END Properties
  #pragma endregion

  #pragma region Operators
  operator CController& () { return Controller; }
  operator const homekit_server_config_t* () const { return mConfig; }

  //END Operators
  #pragma endregion

  #pragma region Public Methods

  /* Activate local Wifi spot.
  * @note This method must be called in the Setup() function.
  * @see CWiFiConnection::APConnect
  */
  void Activate_AP()
  {
    WifiConnection.SetRecomendedMode(WIFI_AP);
  }

  /* Setup the HomeKit device.
  * @note This method must be called in the setup() function.
  */
  bool Setup();

  /* Loop the HomeKit device.
  * @note This method must be called in the loop() function.
  */
  void Loop();

  /* Reset HomeKit pairing.
  * @param reboot If true, the device will reboot after resetting the pairing.
  */
  static void ResetPairing(bool reboot = false);


  //END Public Methods
  #pragma endregion

  #pragma region Private Methods
private:

  static void UpdateBuildInLED(CTicker::CEvent);

  /* Synchronize the date and time with an NTP server.
  */
  static void SyncDateTime();

  //END Private Methods
  #pragma endregion

};

//END CHomeKit
#pragma endregion



#pragma region +Functions

#pragma region GetHomeKitConfig
/* Get the HomeKit configuration.
* @return The CHomeKit configuration or nullptr if CHomeKit is not created.
*/
inline const homekit_server_config_t* GetHomeKitConfig()
{
  return CHomeKit::Singleton ? CHomeKit::Singleton->Config() : nullptr;
}
#pragma endregion

#pragma region  InstallLogging / GetLoggingEnumerator

/* Install a logging object for VERBOSE(), INFO(), WARN(), ERROR() and logging to the HomeKit log.
* @param logging The logging object (CLogging<>)
* @note InstallLogging() is called in CHomeKit::Setup()
*/
void InstallLogging(ILogging_Ptr logging);
void InstallLogging();

/* Get an enumerator for the logging object.
* @return The enumerator for the logging object or nullptr if no logging object is installed.
*/
ILoggingEnumerator_Ptr GetLoggingEnumerator();

#pragma endregion

#pragma region CreatePasswordEnumerator - Functions

/* Create a password enumerator from a static array.
* @tparam VarType The type of the SSID/password pairs. E.g. const char*.
* @param loginTab The array of SSID/password pairs.
* @return The created enumerator.
* @see IPasswordEnumerator
* @example

        CreatePasswordEnumerator("MyWifi", "123456")

--or--

        CreatePasswordEnumerator
        (
            {
                { "MyWifi",         "123456" },
                { "FriendWifi", "654321" },
                [...]
            }
        )

*/
template<typename VarType, size_t N>
IPasswordEnumerator_Ptr CreatePasswordEnumerator(const std::pair<VarType, VarType>(&loginTab)[N])
{
  using ItemType = std::pair<VarType, VarType>;
  using TableType = std::array<ItemType, N>;

