HolgerBurkarth/HomeKit-ESP8266/src/hb_homekit.h
  auto CopyToTable = [](const std::pair<const char*, const char*>(&loginTab)[N]) -> TableType
    {
      TableType Tab;
      for(size_t i = 0; i < N; ++i)
        Tab[i] = ItemType{ std::get<0>(loginTab[i]), std::get<1>(loginTab[i]) };
      return Tab;
    };

  return std::make_unique<CStaticPasswordEnumerator<TableType>>(CopyToTable(loginTab));
}

/* Required specialization for const char */
template<size_t N>
IPasswordEnumerator_Ptr CreatePasswordEnumerator(const std::pair<const char*, const char*>(&loginTab)[N])
{
  return CreatePasswordEnumerator<const char*, N>(loginTab);
}

inline IPasswordEnumerator_Ptr CreatePasswordEnumerator(const char* ssid, const char* pass)
{
  const std::pair<const char*, const char*> Tab[]{ { ssid, pass } };
  return CreatePasswordEnumerator(Tab);
}


#pragma endregion

#pragma region For Each - Functions

#pragma region ForEachAccessory
/*
* @brief: Enumerate all accessories of a homekit configuration
* @param: pConfig: HomeKit configuration
* @param: F func: Function to be called for each accessory:
*   void func(const homekit_accessory_t* pAccessory)
* -or-
*  R func(const homekit_accessory_t* pAccessory)
*/
template<typename F>
void ForEachAccessory(const homekit_server_config_t* pConfig, F func)
{
  if(pConfig)
  {
    for(int i = 0; pConfig->accessories[i]; ++i)
      func(pConfig->accessories[i]);
  }
}
template<typename R, typename F>
R ForEachAccessory(const homekit_server_config_t* pConfig, F func)
{
  if(pConfig)
  {
    for(int i = 0; pConfig->accessories[i]; ++i)
    {
      R tmp = func(pConfig->accessories[i]);
      if(tmp)
        return tmp;
    }
  }
  return R{};
}

#pragma endregion

#pragma region ForEachService
/*
* @brief: Enumerate all services of a homekit accessory
* @param: pAccessory: HomeKit accessory
* @param: F func: Function to be called for each service:
*   void func(const homekit_service_t* pService)
* -or-
*  R func(const homekit_service_t* pService)
*/
template<typename F>
void ForEachService(const homekit_accessory_t* pAccessory, F func)
{
  if(pAccessory)
  {
    for(int i = 0; pAccessory->services[i]; ++i)
      func(pAccessory->services[i]);
  }
}
template<typename R, typename F>
R ForEachService(const homekit_accessory_t* pAccessory, F func)
{
  if(pAccessory)
  {
    for(int i = 0; pAccessory->services[i]; ++i)
    {
      R tmp = func(pAccessory->services[i]);
      if(tmp)
        return tmp;
    }
  }
  return R{};
}

#pragma endregion

#pragma region ForEachCharacteristic
/*
* @brief: Enumerate all characteristics of a homekit service
* @param: pService: HomeKit service
* @param: F func: Function to be called for each characteristic:
*  void func(const homekit_characteristic_t* pCharacteristic)
* -or-
*  R func(const homekit_characteristic_t* pCharacteristic)
*/
template<typename F>
void ForEachCharacteristic(const homekit_service_t* pService, F func)
{
  if(pService)
  {
    for(int i = 0; pService->characteristics[i]; ++i)
      func(pService->characteristics[i]);
  }
}
template<typename R, typename F>
R ForEachCharacteristic(const homekit_service_t* pService, F func)
{
  if(pService)
  {
    for(int i = 0; pService->characteristics[i]; ++i)
    {
      R tmp = func(pService->characteristics[i]);
      if(tmp)
        return tmp;
    }
  }
  return R{};
}

#pragma endregion


//END For Each - Functions
#pragma endregion

#pragma region Find - Functions

/*
* @brief: Find the first service of a given type
* @param pConfig: HomeKit configuration, nullptr -> nullptr
* @param type: Service type (e.g. "SWITCH" or HOMEKIT_SERVICE_SWITCH)
* @return: Pointer to service or nullptr
*/
const homekit_service_t* FindServiceByType(const homekit_server_config_t* pConfig, const char* type);
inline const homekit_service_t* FindServiceByType(const char* type)
{
  return FindServiceByType(GetHomeKitConfig(), type);
}

/*
* @brief: Find the first characteristic of a given name
* @param pConfig: HomeKit configuration, nullptr -> nullptr
* @param name: Service name (e.g. "ON", HOMEKIT_CHARACTERISTIC_ON, "On" )
* @return: Pointer to service or nullptr
*/
homekit_characteristic_t* FindCharacteristicByTypeOrName(const homekit_service_t* pService, const char* typeOrName);

//END Find - Functions
#pragma endregion

#pragma region DeviceName

/* Get the device name from the CHomeKit configuration (CDeviceService)
* @param pConfig: HomeKit configuration, nullptr -> ""
* @return: Device name or ""
* @see CDeviceService
*/
const char* DeviceName(const homekit_server_config_t* pConfig = GetHomeKitConfig());

#pragma endregion

#pragma region Safe_GetLocalTime
/* Similar to getLocalTime.
* If there is no Internet connection, false is returned to avoid a timeout in getLocalTime.
*/
bool Safe_GetLocalTime(tm*);

#pragma endregion

#pragma region Split
std::vector<String> Split(const String& text, char sep);

#pragma endregion

#pragma region +Components like: Menus, Vars, Commands

#pragma region AddWiFiLoginMenu
/* Adds a menu (WiFi) that allows the user to connect to a WiFi network.
* @param alwaysUsePeristentLogin
*       If true, the persistent password enumerator is always used.
*       If False, an already set password enumerator is not changed.
*       @see CreatePasswordEnumerator(), Constructor of CController
*       @note Mainly used for testing, debugging and simulating AP-WiFi situations
* @note Following variables will be supplied:
* - WLOGIN_SSID: The SSID of the first WiFi network to connect to.
* - WLOGIN_PASSWORD: The password of the first WiFi network to connect to.
* - WIFI_LIST: The list of available WiFi networks as an HTML table.
* @note Following commands will be installed:
* - ENTER_WLOGIN: Display the password entry page "/wlogin".
* - LOGIN: Connect to the selected WiFi network.
* @note Following menu items will be added:
* - /wifi: Displays a page with a list of available WIFIs.
* - /wlogin: Displays a page to enter the password for the selected WiFi network.
* @note
*   Should be called before any other menus are added so that the 'WiFi' menu item
    is displayed as the first page in AP WiFi mode.  
* @note
*   A persistent password enumerator is installed. This replaces any previously
*   installed enumerator.
*
* @see CWiFiConnection::SetPasswordEnumerator
*/
CController& AddWiFiLoginMenu(CController&, bool alwaysUsePeristentLogin = true);

#pragma endregion

#pragma region AddDeviceMenu
/* Add a info menu item to the web site "/device".
 * The Device item is created on the right side of the menu bar.
 * This page displays information about the device and allows
 * you to restart and unpaired the device.
 * @see AddMenuItem
*/
CController& AddDeviceMenu(CController&);
#pragma endregion

