HolgerBurkarth/HomeKit-ESP8266/src/hb_homekit.h
#pragma region AddLoggingMenu
/* Add a log menu item to the web site. "/log"
* The Log item is created on the right side of the menu bar.
* This page displays the most recently recorded log events.
* @see AddMenuItem
*/
CController& AddLoggingMenu(CController&);
#pragma endregion

#pragma region AddStandardMenus
/* Adds standard menu items to the controller.
* @note The following menu items are added:
* - Logging
* - Device
*/
inline CController& AddStandardMenus(CController& c)
{
  AddLoggingMenu(c);
  AddDeviceMenu(c);
  return c;
}

#pragma endregion

#pragma region +ActionUI

#pragma region InstallActionUI
/* Installs the action UI.
* @see ActionUI_JavaScript, ActionUI_CSS
* @Elements:
* - ACTION_BUTTON
*   @note ActionUI_JavaScript must be use in .JavaScript for AddMenuItem()
*   Creates a button that calls a JavaScript function.
*   Functions for setting and reading variables are provided by the @ref ActionUI_JavaScript().
*   @see ActionUI_JavaScript for more information.
*       @syntax:
*      {ACTION_BUTTON:OnFunction:Text}
*   --or--
*      {ACTION_BUTTON:ID:OnFunction:Text}
*   @example
*     {ACTION_BUTTON:SwtID:SetState(true):Switch ON}
*       ==>>   <button id='SwtID' onclick='SetState(true)'>Switch ON</button>
*
* - ACTION_CHECKBOX
*       @syntax:
*      {ACTION_CHECKBOX:ID:OnFunction}
*   @example
*     {ACTION_CHECKBOX:switch:SetSwitch(this.checked)}
*
*
*/
CController& InstallActionUI(CController&);

#pragma endregion

#pragma region ActionUI_JavaScript
/* JavaScript support for action buttons.
* @return The JavaScript code for action buttons.
* @note Used within .JavaScript for @ref AddMenuItem()

* @functions
* - InvokeAction(varLine, functor)
*   @param varLine The variable line to send to the server.
*   @param functor The function to call when the server response is received.
*   @note The functor is called with the server response as a parameter.
*   @example
*     InvokeAction("DATE", function(responseText) { console.log(responseText); });
*     --or--
*     InvokeAction("MYVAL=1", responseText => console.log(responseText));
*
* - SetVar(varName, varValue)
*   @param varName The name of the variable.
*   @param varValue The value of the variable.
*   @example SetVar("MYVAL", 1);
*
* - ForSetVar(varName, varValue, functor)
*   @param varName The name of the variable.
*   @param varValue The value of the variable.
*   @param functor The function to call when the server response is received.
*   @note The functor is called with the server response as a parameter.
*   @example ForSetVar("MYVAL", 1, function(responseText) { console.log(responseText); });
*
* - ForVar(varName, functor)
*   @param varName The name of the variable.
*   @param functor The function to call when the server response is received.
*   @note The functor is called with the server response as a parameter.
*   @example ForVar("DATE", function(text) { console.log(text); });
*
*/
CTextEmitter ActionUI_JavaScript();

#pragma endregion

#pragma region ActionUICSSSupport
/* CSS support for action buttons.
* @note Used within .CSS for @ref AddMenuItem()
*/
CTextEmitter ActionUI_CSS();

#pragma endregion



//END ActionUI
#pragma endregion

#pragma region UIUtils_JavaScript
/* @info: JavaScript functions for manipulating the UI
*  The following functions are available:
*  param idOrHd : id or HTMLElement: e.g: 'myId' or document.getElementById('myId')
*
* Functions:
*  HideElement(idOrHd, hide)
*  DisableElement(idOrHd, disable)
*  SetElementInnerHTML(idOrHd, text)
*  SetElementChecked(idOrHd, boolValue)
*  LogDebug(txt)
*
* Strings:
*   Unit_cm  -> "cm"
*   Unit_s   -> "s"
*
*/
CTextEmitter UIUtils_JavaScript();

#pragma endregion

#pragma region Chart_JavaScript
/* JavaScript code for drawing a chart.
* The code is used by the CChart class.
*
* @member field LeftMargin
* @member field RightMargin
* @member field TopMargin
* @member field BottomMargin
* @member field GridColor
* @member field NoniusColor
* @member field DataColor
* @member field AxisNumberColor
*
* @param dataPoints Array of data points.
*        Each data point is an array with two values [x, y] or one value y.
* @member function SetDataPoints(dataPoints)
*
* @member function SetHrzAxis(start, end, step)
* @member function SetVrtAxis(start, end, step)
* @member function SwapXYAxis()
* @member function Clear()
* @member function DrawHrzGrid()
* @member function DrawVrtGrid()
*
* @param trackNumber [0 .. 3]
* @member function DrawEvent(trackNumber, x, txt, colorLine, colorBg)
*
* @member function DrawCurve()
* @member function DrawDots()
* @member function DrawHrzAxisNumbers()
* @member function DrawVrtAxisNumbers()
* @member function DrawBoundaryBox()
*
* @example
* var Chart = CChart(canvasElement);
* Chart.SetDataPoints([[0, 0], [1, 3], [2, 2], [3, 1]]);
* Chart.SetHrzAxis(0, 10, 1);
* Chart.SetVrtAxis(0, 10, 1);
* Chart.DrawCurve();
*
*/
CTextEmitter Chart_JavaScript();

#pragma endregion


//END Functions
#pragma endregion



#pragma region Debug/Analysis - Functions

#pragma region DebugPrintConfig
/* List the HomeKit configuration to the serial port.
* @param pConfig The HomeKit configuration to print.
* @example

HomeKit Config switch  config_number:1
    Accessory switch id:1 config_number:1
        Service ACCESSORY_INFORMATION id:1 hidden:0 primary:1
          IDENTIFY "Identify"             = false
          MANUFACTURER "Manufacturer"     = "Holger Burkarth"
          MODEL "Model"                  = "ESP8266/ESP32"
          NAME "Name"                     = "SwitchSample"
          SERIAL_NUMBER "Serial Number"  = "0123456"
          FIRMWARE_REVISION "Firmware Revision"    = "1.0"

        Service SWITCH id:8 hidden:0 primary:1
          ON "On"         = false
          NAME "Name"     = "SwitchParam"
*/
inline void DebugPrintConfig(const homekit_server_config_t* pConfig)
{
  Serial.printf
  (
    "HomeKit Config %s  config_number:%d\n"
    , homekit_accessory_category_to_string(pConfig->category)
    , pConfig->config_number
  );
  ForEachAccessory(pConfig, [&](const homekit_accessory_t* pAccessory)
    {
      Serial.printf
      (
        "\tAccessory %s id:%d config_number:%d\n"
        , homekit_accessory_category_to_string(pAccessory->category)
        , pAccessory->id
        , pAccessory->config_number
      );
      ForEachService(pAccessory, [&](const homekit_service_t* pService)
        {
          Serial.printf
          (
            "\t\tService %s id:%d hidden:%d primary:%d\n"
            , homekit_service_identify_to_string(pService->type)
            , pService->id
            , pService->hidden
            , pService->primary
          );

          ForEachCharacteristic(pService, [&](const homekit_characteristic_t* pCharacteristic)
            {
              Serial.printf
              (
                "\t\t\t%16s \"%s\"\t = %s\n"
                , homekit_characteristic_identify_to_string(pCharacteristic->type)
                , pCharacteristic->description
                , to_string(pCharacteristic->value).c_str()
              );
            });

          Serial.println();
        });

      Serial.println();
    });
}

#pragma endregion


//END Debug/Analysis - Functions
#pragma endregion

//END Functions
#pragma endregion



#pragma region Epilog
} // namespace HBHomeKit
#pragma endregion
